Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x5a0 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xf6cd0): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x143b7): ../Core/Src/dma.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xa7373): D:/Documents/PROJECTS/101 HELIOS/3 Programmieren STM32/Firmware/HELIOS_STM32/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <2a>   DW_AT_encoding    : 5	(signed)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_type        : <0x28a>
    <30>   DW_AT_decl_file   : 2
    <31>   DW_AT_decl_line   : 66
    <32>   DW_AT_decl_column : 1
    <33>   DW_AT_sibling     : <0x28a>
 <2><37>: Abbrev Number: 3 (DW_TAG_enumerator)
    <38>   DW_AT_name        : (indirect string, offset: 0x25811): NonMaskableInt_IRQn
    <3c>   DW_AT_const_value : -14
 <2><3d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <3e>   DW_AT_name        : (indirect string, offset: 0xae11e): HardFault_IRQn

 <2><229>: Abbrev Number: 4 (DW_TAG_enumerator)
    <22a>   DW_AT_name        : (indirect string, offset: 0x648bc): SAI1_IRQn
    <22e>   DW_AT_const_value : 74
 <2><22f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <230>   DW_AT_name        : (indirect string, offset: 0xd8300): SAI2_IRQn
    <234>   DW_AT_const_value : 75
 <2><235>: Abbrev Number: 4 (DW_TAG_enumerator)
    <236>   DW_AT_name        : (indirect string, offset: 0xf2457): SWPMI1_IRQn
    <23a>   DW_AT_const_value : 76
 <2><23b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <23c>   DW_AT_name        : (indirect string, offset: 0x603f7): TSC_IRQn
    <240>   DW_AT_const_value : 77
 <2><241>: Abbrev Number: 4 (DW_TAG_enumerator)
    <242>   DW_AT_name        : (indirect string, offset: 0x4ba4b): LCD_IRQn
    <246>   DW_AT_const_value : 78
 <2><247>: Abbrev Number: 4 (DW_TAG_enumerator)
    <248>   DW_AT_name        : (indirect string, offset: 0xb8e1f): RNG_IRQn
    <24c>   DW_AT_const_value : 80
 <2><24d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <24e>   DW_AT_name        : (indirect string, offset: 0x51846): FPU_IRQn
    <252>   DW_AT_const_value : 81
 <2><253>: Abbrev Number: 4 (DW_TAG_enumerator)
    <254>   DW_AT_name        : (indirect string, offset: 0xa1520): CRS_IRQn
    <258>   DW_AT_const_value : 82
 <2><259>: Abbrev Number: 4 (DW_TAG_enumerator)
    <25a>   DW_AT_name        : (indirect string, offset: 0xa9934): I2C4_EV_IRQn
    <25e>   DW_AT_const_value : 83
 <2><25f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <260>   DW_AT_name        : (indirect string, offset: 0xefa32): I2C4_ER_IRQn
    <264>   DW_AT_const_value : 84
 <2><265>: Abbrev Number: 4 (DW_TAG_enumerator)
    <266>   DW_AT_name        : (indirect string, offset: 0x79c7c): DCMI_IRQn
    <26a>   DW_AT_const_value : 85
 <2><26b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <26c>   DW_AT_name        : (indirect string, offset: 0xac3d2): CAN2_TX_IRQn
    <270>   DW_AT_const_value : 86
 <2><271>: Abbrev Number: 4 (DW_TAG_enumerator)
    <272>   DW_AT_name        : (indirect string, offset: 0x8d40e): CAN2_RX0_IRQn
    <276>   DW_AT_const_value : 87
 <2><277>: Abbrev Number: 4 (DW_TAG_enumerator)
    <278>   DW_AT_name        : (indirect string, offset: 0xa28d2): CAN2_RX1_IRQn
    <27c>   DW_AT_const_value : 88
 <2><27d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <27e>   DW_AT_name        : (indirect string, offset: 0xc80db): CAN2_SCE_IRQn
    <282>   DW_AT_const_value : 89
 <2><283>: Abbrev Number: 4 (DW_TAG_enumerator)
    <284>   DW_AT_name        : (indirect string, offset: 0x7e4dd): DMA2D_IRQn
    <288>   DW_AT_const_value : 90
 <2><289>: Abbrev Number: 0
 <1><28a>: Abbrev Number: 5 (DW_TAG_base_type)
    <28b>   DW_AT_byte_size   : 1
    <28c>   DW_AT_encoding    : 6	(signed char)
    <28d>   DW_AT_name        : (indirect string, offset: 0x10b5e9): signed char
 <1><291>: Abbrev Number: 6 (DW_TAG_typedef)
    <292>   DW_AT_name        : (indirect string, offset: 0xddf7e): IRQn_Type
    <296>   DW_AT_decl_file   : 2
    <297>   DW_AT_decl_line   : 168
    <298>   DW_AT_decl_column : 3
    <299>   DW_AT_type        : <0x29>
 <1><29d>: Abbrev Number: 5 (DW_TAG_base_type)
    <29e>   DW_AT_byte_size   : 1
    <29f>   DW_AT_encoding    : 8	(unsigned char)
    <2a0>   DW_AT_name        : (indirect string, offset: 0x100a9d): unsigned char
 <1><2a4>: Abbrev Number: 5 (DW_TAG_base_type)
    <2a5>   DW_AT_byte_size   : 2
    <2a6>   DW_AT_encoding    : 5	(signed)
    <2a7>   DW_AT_name        : (indirect string, offset: 0xbd259): short int
 <1><2ab>: Abbrev Number: 5 (DW_TAG_base_type)
    <2ac>   DW_AT_byte_size   : 2
    <2ad>   DW_AT_encoding    : 7	(unsigned)
    <2ae>   DW_AT_name        : (indirect string, offset: 0xf379b): short unsigned int
 <1><2b2>: Abbrev Number: 5 (DW_TAG_base_type)
    <2b3>   DW_AT_byte_size   : 4
    <2b4>   DW_AT_encoding    : 5	(signed)
    <2b5>   DW_AT_name        : (indirect string, offset: 0x155ad): long int
 <1><2b9>: Abbrev Number: 6 (DW_TAG_typedef)
    <2ba>   DW_AT_name        : (indirect string, offset: 0xa2e91): __uint32_t
    <2be>   DW_AT_decl_file   : 3
    <2bf>   DW_AT_decl_line   : 79
    <2c0>   DW_AT_decl_column : 25
    <2c1>   DW_AT_type        : <0x2c5>
 <1><2c5>: Abbrev Number: 5 (DW_TAG_base_type)
    <2c6>   DW_AT_byte_size   : 4
    <2c7>   DW_AT_encoding    : 7	(unsigned)
    <2c8>   DW_AT_name        : (indirect string, offset: 0x60cb9): long unsigned int
 <1><2cc>: Abbrev Number: 5 (DW_TAG_base_type)
    <2cd>   DW_AT_byte_size   : 8
    <2ce>   DW_AT_encoding    : 5	(signed)
    <2cf>   DW_AT_name        : (indirect string, offset: 0x745fe): long long int
 <1><2d3>: Abbrev Number: 5 (DW_TAG_base_type)
    <2d4>   DW_AT_byte_size   : 8
    <2d5>   DW_AT_encoding    : 7	(unsigned)
    <2d6>   DW_AT_name        : (indirect string, offset: 0x34cbc): long long unsigned int
 <1><2da>: Abbrev Number: 7 (DW_TAG_base_type)
    <2db>   DW_AT_byte_size   : 4
    <2dc>   DW_AT_encoding    : 5	(signed)
    <2dd>   DW_AT_name        : int
 <1><2e1>: Abbrev Number: 5 (DW_TAG_base_type)
    <2e2>   DW_AT_byte_size   : 4
    <2e3>   DW_AT_encoding    : 7	(unsigned)
    <2e4>   DW_AT_name        : (indirect string, offset: 0x149e3): unsigned int
 <1><2e8>: Abbrev Number: 6 (DW_TAG_typedef)
    <2e9>   DW_AT_name        : (indirect string, offset: 0x107a66): uint32_t
    <2ed>   DW_AT_decl_file   : 4
    <2ee>   DW_AT_decl_line   : 48
    <2ef>   DW_AT_decl_column : 20
    <2f0>   DW_AT_type        : <0x2b9>
 <1><2f4>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <2f5>   DW_AT_type        : <0x2e8>
 <1><2f9>: Abbrev Number: 9 (DW_TAG_structure_type)
    <2fa>   DW_AT_byte_size   : 160
    <2fb>   DW_AT_decl_file   : 2
    <2fc>   DW_AT_decl_line   : 755
    <2fe>   DW_AT_decl_column : 9
    <2ff>   DW_AT_sibling     : <0x533>
 <2><303>: Abbrev Number: 10 (DW_TAG_member)
    <304>   DW_AT_name        : CR
    <307>   DW_AT_decl_file   : 2
    <308>   DW_AT_decl_line   : 757
    <30a>   DW_AT_decl_column : 17
    <30b>   DW_AT_type        : <0x2f4>
    <30f>   DW_AT_data_member_location: 0
 <2><310>: Abbrev Number: 11 (DW_TAG_member)
    <311>   DW_AT_name        : (indirect string, offset: 0x91f38): ICSCR
    <315>   DW_AT_decl_file   : 2
    <316>   DW_AT_decl_line   : 758
    <318>   DW_AT_decl_column : 17
    <319>   DW_AT_type        : <0x2f4>
    <31d>   DW_AT_data_member_location: 4
 <2><31e>: Abbrev Number: 11 (DW_TAG_member)
    <31f>   DW_AT_name        : (indirect string, offset: 0x53247): CFGR
    <323>   DW_AT_decl_file   : 2
    <324>   DW_AT_decl_line   : 759
    <326>   DW_AT_decl_column : 17
    <327>   DW_AT_type        : <0x2f4>
    <32b>   DW_AT_data_member_location: 8
 <2><32c>: Abbrev Number: 11 (DW_TAG_member)
    <32d>   DW_AT_name        : (indirect string, offset: 0xb2aad): PLLCFGR
    <331>   DW_AT_decl_file   : 2
    <332>   DW_AT_decl_line   : 760
    <334>   DW_AT_decl_column : 17
    <335>   DW_AT_type        : <0x2f4>
    <339>   DW_AT_data_member_location: 12
 <2><33a>: Abbrev Number: 11 (DW_TAG_member)
    <33b>   DW_AT_name        : (indirect string, offset: 0x53240): PLLSAI1CFGR
    <33f>   DW_AT_decl_file   : 2
    <340>   DW_AT_decl_line   : 761
    <342>   DW_AT_decl_column : 17
    <343>   DW_AT_type        : <0x2f4>
    <347>   DW_AT_data_member_location: 16
 <2><348>: Abbrev Number: 11 (DW_TAG_member)
    <349>   DW_AT_name        : (indirect string, offset: 0xa65a2): PLLSAI2CFGR
    <34d>   DW_AT_decl_file   : 2
    <34e>   DW_AT_decl_line   : 762
    <350>   DW_AT_decl_column : 17
    <351>   DW_AT_type        : <0x2f4>
    <355>   DW_AT_data_member_location: 20
 <2><356>: Abbrev Number: 11 (DW_TAG_member)
    <357>   DW_AT_name        : (indirect string, offset: 0x310f): CIER
    <35b>   DW_AT_decl_file   : 2
    <35c>   DW_AT_decl_line   : 763
    <35e>   DW_AT_decl_column : 17
    <35f>   DW_AT_type        : <0x2f4>
    <363>   DW_AT_data_member_location: 24
 <2><364>: Abbrev Number: 11 (DW_TAG_member)
    <365>   DW_AT_name        : (indirect string, offset: 0x3915): CIFR
    <369>   DW_AT_decl_file   : 2
    <36a>   DW_AT_decl_line   : 764
    <36c>   DW_AT_decl_column : 17
    <36d>   DW_AT_type        : <0x2f4>
    <371>   DW_AT_data_member_location: 28
 <2><372>: Abbrev Number: 11 (DW_TAG_member)
    <373>   DW_AT_name        : (indirect string, offset: 0x1ffe): CICR
    <377>   DW_AT_decl_file   : 2
    <378>   DW_AT_decl_line   : 765
    <37a>   DW_AT_decl_column : 17
    <37b>   DW_AT_type        : <0x2f4>
    <37f>   DW_AT_data_member_location: 32
 <2><380>: Abbrev Number: 11 (DW_TAG_member)
    <381>   DW_AT_name        : (indirect string, offset: 0xef81c): RESERVED0
    <385>   DW_AT_decl_file   : 2
    <386>   DW_AT_decl_line   : 766
    <388>   DW_AT_decl_column : 17
    <389>   DW_AT_type        : <0x2e8>
    <38d>   DW_AT_data_member_location: 36
 <2><38e>: Abbrev Number: 11 (DW_TAG_member)
    <38f>   DW_AT_name        : (indirect string, offset: 0xcaa00): AHB1RSTR
    <393>   DW_AT_decl_file   : 2
    <394>   DW_AT_decl_line   : 767
    <396>   DW_AT_decl_column : 17
    <397>   DW_AT_type        : <0x2f4>
    <39b>   DW_AT_data_member_location: 40
 <2><39c>: Abbrev Number: 11 (DW_TAG_member)
    <39d>   DW_AT_name        : (indirect string, offset: 0x1d45c): AHB2RSTR
    <3a1>   DW_AT_decl_file   : 2
    <3a2>   DW_AT_decl_line   : 768
    <3a4>   DW_AT_decl_column : 17
    <3a5>   DW_AT_type        : <0x2f4>
    <3a9>   DW_AT_data_member_location: 44
 <2><3aa>: Abbrev Number: 11 (DW_TAG_member)
    <3ab>   DW_AT_name        : (indirect string, offset: 0x52d8f): AHB3RSTR
    <3af>   DW_AT_decl_file   : 2
    <3b0>   DW_AT_decl_line   : 769
    <3b2>   DW_AT_decl_column : 17
    <3b3>   DW_AT_type        : <0x2f4>
    <3b7>   DW_AT_data_member_location: 48
 <2><3b8>: Abbrev Number: 11 (DW_TAG_member)
    <3b9>   DW_AT_name        : (indirect string, offset: 0xef826): RESERVED1
    <3bd>   DW_AT_decl_file   : 2
    <3be>   DW_AT_decl_line   : 770
    <3c0>   DW_AT_decl_column : 17
    <3c1>   DW_AT_type        : <0x2e8>
    <3c5>   DW_AT_data_member_location: 52
 <2><3c6>: Abbrev Number: 11 (DW_TAG_member)
    <3c7>   DW_AT_name        : (indirect string, offset: 0x33b82): APB1RSTR1
    <3cb>   DW_AT_decl_file   : 2
    <3cc>   DW_AT_decl_line   : 771
    <3ce>   DW_AT_decl_column : 17
    <3cf>   DW_AT_type        : <0x2f4>
    <3d3>   DW_AT_data_member_location: 56
 <2><3d4>: Abbrev Number: 11 (DW_TAG_member)
    <3d5>   DW_AT_name        : (indirect string, offset: 0x33b8c): APB1RSTR2
    <3d9>   DW_AT_decl_file   : 2
    <3da>   DW_AT_decl_line   : 772
    <3dc>   DW_AT_decl_column : 17
    <3dd>   DW_AT_type        : <0x2f4>
    <3e1>   DW_AT_data_member_location: 60
 <2><3e2>: Abbrev Number: 11 (DW_TAG_member)
    <3e3>   DW_AT_name        : (indirect string, offset: 0x6e64d): APB2RSTR
    <3e7>   DW_AT_decl_file   : 2
    <3e8>   DW_AT_decl_line   : 773
    <3ea>   DW_AT_decl_column : 17
    <3eb>   DW_AT_type        : <0x2f4>
    <3ef>   DW_AT_data_member_location: 64
 <2><3f0>: Abbrev Number: 11 (DW_TAG_member)
    <3f1>   DW_AT_name        : (indirect string, offset: 0xef830): RESERVED2
    <3f5>   DW_AT_decl_file   : 2
    <3f6>   DW_AT_decl_line   : 774
    <3f8>   DW_AT_decl_column : 17
    <3f9>   DW_AT_type        : <0x2e8>
    <3fd>   DW_AT_data_member_location: 68
 <2><3fe>: Abbrev Number: 11 (DW_TAG_member)
    <3ff>   DW_AT_name        : (indirect string, offset: 0x149a9): AHB1ENR
    <403>   DW_AT_decl_file   : 2
    <404>   DW_AT_decl_line   : 775
    <406>   DW_AT_decl_column : 17
    <407>   DW_AT_type        : <0x2f4>
    <40b>   DW_AT_data_member_location: 72
 <2><40c>: Abbrev Number: 11 (DW_TAG_member)
    <40d>   DW_AT_name        : (indirect string, offset: 0x43066): AHB2ENR
    <411>   DW_AT_decl_file   : 2
    <412>   DW_AT_decl_line   : 776
    <414>   DW_AT_decl_column : 17
    <415>   DW_AT_type        : <0x2f4>
    <419>   DW_AT_data_member_location: 76
 <2><41a>: Abbrev Number: 11 (DW_TAG_member)
    <41b>   DW_AT_name        : (indirect string, offset: 0x7242f): AHB3ENR
    <41f>   DW_AT_decl_file   : 2
    <420>   DW_AT_decl_line   : 777
    <422>   DW_AT_decl_column : 17
    <423>   DW_AT_type        : <0x2f4>
    <427>   DW_AT_data_member_location: 80
 <2><428>: Abbrev Number: 11 (DW_TAG_member)
    <429>   DW_AT_name        : (indirect string, offset: 0xef83a): RESERVED3
    <42d>   DW_AT_decl_file   : 2
    <42e>   DW_AT_decl_line   : 778
    <430>   DW_AT_decl_column : 17
    <431>   DW_AT_type        : <0x2e8>
    <435>   DW_AT_data_member_location: 84
 <2><436>: Abbrev Number: 11 (DW_TAG_member)
    <437>   DW_AT_name        : (indirect string, offset: 0x8657): APB1ENR1
    <43b>   DW_AT_decl_file   : 2
    <43c>   DW_AT_decl_line   : 779
    <43e>   DW_AT_decl_column : 17
    <43f>   DW_AT_type        : <0x2f4>
    <443>   DW_AT_data_member_location: 88
 <2><444>: Abbrev Number: 11 (DW_TAG_member)
    <445>   DW_AT_name        : (indirect string, offset: 0x8660): APB1ENR2
    <449>   DW_AT_decl_file   : 2
    <44a>   DW_AT_decl_line   : 780
    <44c>   DW_AT_decl_column : 17
    <44d>   DW_AT_type        : <0x2f4>
    <451>   DW_AT_data_member_location: 92
 <2><452>: Abbrev Number: 11 (DW_TAG_member)
    <453>   DW_AT_name        : (indirect string, offset: 0x1e385): APB2ENR
    <457>   DW_AT_decl_file   : 2
    <458>   DW_AT_decl_line   : 781
    <45a>   DW_AT_decl_column : 17
    <45b>   DW_AT_type        : <0x2f4>
    <45f>   DW_AT_data_member_location: 96
 <2><460>: Abbrev Number: 11 (DW_TAG_member)
    <461>   DW_AT_name        : (indirect string, offset: 0x97c5e): RESERVED4
    <465>   DW_AT_decl_file   : 2
    <466>   DW_AT_decl_line   : 782
    <468>   DW_AT_decl_column : 17
    <469>   DW_AT_type        : <0x2e8>
    <46d>   DW_AT_data_member_location: 100
 <2><46e>: Abbrev Number: 11 (DW_TAG_member)
    <46f>   DW_AT_name        : (indirect string, offset: 0x755af): AHB1SMENR
    <473>   DW_AT_decl_file   : 2
    <474>   DW_AT_decl_line   : 783
    <476>   DW_AT_decl_column : 17
    <477>   DW_AT_type        : <0x2f4>
    <47b>   DW_AT_data_member_location: 104
 <2><47c>: Abbrev Number: 11 (DW_TAG_member)
    <47d>   DW_AT_name        : (indirect string, offset: 0xe86ec): AHB2SMENR
    <481>   DW_AT_decl_file   : 2
    <482>   DW_AT_decl_line   : 784
    <484>   DW_AT_decl_column : 17
    <485>   DW_AT_type        : <0x2f4>
    <489>   DW_AT_data_member_location: 108
 <2><48a>: Abbrev Number: 11 (DW_TAG_member)
    <48b>   DW_AT_name        : (indirect string, offset: 0x5c89c): AHB3SMENR
    <48f>   DW_AT_decl_file   : 2
    <490>   DW_AT_decl_line   : 785
    <492>   DW_AT_decl_column : 17
    <493>   DW_AT_type        : <0x2f4>
    <497>   DW_AT_data_member_location: 112
 <2><498>: Abbrev Number: 11 (DW_TAG_member)
    <499>   DW_AT_name        : (indirect string, offset: 0xef868): RESERVED5
    <49d>   DW_AT_decl_file   : 2
    <49e>   DW_AT_decl_line   : 786
    <4a0>   DW_AT_decl_column : 17
    <4a1>   DW_AT_type        : <0x2e8>
    <4a5>   DW_AT_data_member_location: 116
 <2><4a6>: Abbrev Number: 11 (DW_TAG_member)
    <4a7>   DW_AT_name        : (indirect string, offset: 0x94ca): APB1SMENR1
    <4ab>   DW_AT_decl_file   : 2
    <4ac>   DW_AT_decl_line   : 787
    <4ae>   DW_AT_decl_column : 17
    <4af>   DW_AT_type        : <0x2f4>
    <4b3>   DW_AT_data_member_location: 120
 <2><4b4>: Abbrev Number: 11 (DW_TAG_member)
    <4b5>   DW_AT_name        : (indirect string, offset: 0x94d5): APB1SMENR2
    <4b9>   DW_AT_decl_file   : 2
    <4ba>   DW_AT_decl_line   : 788
    <4bc>   DW_AT_decl_column : 17
    <4bd>   DW_AT_type        : <0x2f4>
    <4c1>   DW_AT_data_member_location: 124
 <2><4c2>: Abbrev Number: 11 (DW_TAG_member)
    <4c3>   DW_AT_name        : (indirect string, offset: 0xcd013): APB2SMENR
    <4c7>   DW_AT_decl_file   : 2
    <4c8>   DW_AT_decl_line   : 789
    <4ca>   DW_AT_decl_column : 17
    <4cb>   DW_AT_type        : <0x2f4>
    <4cf>   DW_AT_data_member_location: 128
 <2><4d0>: Abbrev Number: 11 (DW_TAG_member)
    <4d1>   DW_AT_name        : (indirect string, offset: 0xef872): RESERVED6
    <4d5>   DW_AT_decl_file   : 2
    <4d6>   DW_AT_decl_line   : 790
    <4d8>   DW_AT_decl_column : 17
    <4d9>   DW_AT_type        : <0x2e8>
    <4dd>   DW_AT_data_member_location: 132
 <2><4de>: Abbrev Number: 11 (DW_TAG_member)
    <4df>   DW_AT_name        : (indirect string, offset: 0x4cfa2): CCIPR
    <4e3>   DW_AT_decl_file   : 2
    <4e4>   DW_AT_decl_line   : 791
    <4e6>   DW_AT_decl_column : 17
    <4e7>   DW_AT_type        : <0x2f4>
    <4eb>   DW_AT_data_member_location: 136
 <2><4ec>: Abbrev Number: 11 (DW_TAG_member)
    <4ed>   DW_AT_name        : (indirect string, offset: 0xef87c): RESERVED7
    <4f1>   DW_AT_decl_file   : 2
    <4f2>   DW_AT_decl_line   : 792
    <4f4>   DW_AT_decl_column : 17
    <4f5>   DW_AT_type        : <0x2e8>
    <4f9>   DW_AT_data_member_location: 140
 <2><4fa>: Abbrev Number: 11 (DW_TAG_member)
    <4fb>   DW_AT_name        : (indirect string, offset: 0x41b23): BDCR
    <4ff>   DW_AT_decl_file   : 2
    <500>   DW_AT_decl_line   : 793
    <502>   DW_AT_decl_column : 17
    <503>   DW_AT_type        : <0x2f4>
    <507>   DW_AT_data_member_location: 144
 <2><508>: Abbrev Number: 10 (DW_TAG_member)
    <509>   DW_AT_name        : CSR
    <50d>   DW_AT_decl_file   : 2
    <50e>   DW_AT_decl_line   : 794
    <510>   DW_AT_decl_column : 17
    <511>   DW_AT_type        : <0x2f4>
    <515>   DW_AT_data_member_location: 148
 <2><516>: Abbrev Number: 11 (DW_TAG_member)
    <517>   DW_AT_name        : (indirect string, offset: 0x44697): CRRCR
    <51b>   DW_AT_decl_file   : 2
    <51c>   DW_AT_decl_line   : 795
    <51e>   DW_AT_decl_column : 17
    <51f>   DW_AT_type        : <0x2f4>
    <523>   DW_AT_data_member_location: 152
 <2><524>: Abbrev Number: 11 (DW_TAG_member)
    <525>   DW_AT_name        : (indirect string, offset: 0xe004b): CCIPR2
    <529>   DW_AT_decl_file   : 2
    <52a>   DW_AT_decl_line   : 796
    <52c>   DW_AT_decl_column : 17
    <52d>   DW_AT_type        : <0x2f4>
    <531>   DW_AT_data_member_location: 156
 <2><532>: Abbrev Number: 0
 <1><533>: Abbrev Number: 12 (DW_TAG_typedef)
    <534>   DW_AT_name        : (indirect string, offset: 0x76457): RCC_TypeDef
    <538>   DW_AT_decl_file   : 2
    <539>   DW_AT_decl_line   : 797
    <53b>   DW_AT_decl_column : 3
    <53c>   DW_AT_type        : <0x2f9>
 <1><540>: Abbrev Number: 5 (DW_TAG_base_type)
    <541>   DW_AT_byte_size   : 8
    <542>   DW_AT_encoding    : 4	(float)
    <543>   DW_AT_name        : (indirect string, offset: 0xffd83): long double
 <1><547>: Abbrev Number: 13 (DW_TAG_subprogram)
    <548>   DW_AT_external    : 1
    <548>   DW_AT_name        : (indirect string, offset: 0x1ed93): HAL_NVIC_EnableIRQ
    <54c>   DW_AT_decl_file   : 5
    <54d>   DW_AT_decl_line   : 272
    <54f>   DW_AT_decl_column : 6
    <550>   DW_AT_prototyped  : 1
    <550>   DW_AT_declaration : 1
    <550>   DW_AT_sibling     : <0x55a>
 <2><554>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <555>   DW_AT_type        : <0x291>
 <2><559>: Abbrev Number: 0
 <1><55a>: Abbrev Number: 13 (DW_TAG_subprogram)
    <55b>   DW_AT_external    : 1
    <55b>   DW_AT_name        : (indirect string, offset: 0xd289d): HAL_NVIC_SetPriority
    <55f>   DW_AT_decl_file   : 5
    <560>   DW_AT_decl_line   : 271
    <562>   DW_AT_decl_column : 6
    <563>   DW_AT_prototyped  : 1
    <563>   DW_AT_declaration : 1
    <563>   DW_AT_sibling     : <0x577>
 <2><567>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <568>   DW_AT_type        : <0x291>
 <2><56c>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <56d>   DW_AT_type        : <0x2e8>
 <2><571>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <572>   DW_AT_type        : <0x2e8>
 <2><576>: Abbrev Number: 0
 <1><577>: Abbrev Number: 15 (DW_TAG_subprogram)
    <578>   DW_AT_external    : 1
    <578>   DW_AT_name        : (indirect string, offset: 0x93034): MX_DMA_Init
    <57c>   DW_AT_decl_file   : 1
    <57d>   DW_AT_decl_line   : 39
    <57e>   DW_AT_decl_column : 6
    <57f>   DW_AT_prototyped  : 1
    <57f>   DW_AT_low_pc      : 0x8000588
    <583>   DW_AT_high_pc     : 0x3c
    <587>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <589>   DW_AT_GNU_all_tail_call_sites: 1
 <2><589>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <58a>   DW_AT_low_pc      : 0x800058e
    <58e>   DW_AT_high_pc     : 0x18
 <3><592>: Abbrev Number: 17 (DW_TAG_variable)
    <593>   DW_AT_name        : (indirect string, offset: 0x693c0): tmpreg
    <597>   DW_AT_decl_file   : 1
    <598>   DW_AT_decl_line   : 43
    <599>   DW_AT_decl_column : 3
    <59a>   DW_AT_type        : <0x2f4>
    <59e>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><5a1>: Abbrev Number: 0
 <2><5a2>: Abbrev Number: 0
 <1><5a3>: Abbrev Number: 0
  Compilation Unit @ offset 0x5a4:
   Length:        0x12c0 (32-bit)
   Version:       4
   Abbrev Offset: 0xf8
   Pointer Size:  4
 <0><5af>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <5b0>   DW_AT_producer    : (indirect string, offset: 0xf6cd0): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <5b4>   DW_AT_language    : 12	(ANSI C99)
    <5b5>   DW_AT_name        : (indirect string, offset: 0x10706e): ../Core/Src/freertos.c
    <5b9>   DW_AT_comp_dir    : (indirect string, offset: 0xa7373): D:/Documents/PROJECTS/101 HELIOS/3 Programmieren STM32/Firmware/HELIOS_STM32/Debug
    <5bd>   DW_AT_ranges      : 0x10
    <5c1>   DW_AT_low_pc      : 0x0
    <5c5>   DW_AT_stmt_list   : 0x713
    <5c9>   DW_AT_GNU_macros  : 0x279e8
 <1><5cd>: Abbrev Number: 2 (DW_TAG_base_type)
    <5ce>   DW_AT_byte_size   : 4
    <5cf>   DW_AT_encoding    : 5	(signed)
    <5d0>   DW_AT_name        : int
 <1><5d4>: Abbrev Number: 3 (DW_TAG_base_type)
    <5d5>   DW_AT_byte_size   : 4
    <5d6>   DW_AT_encoding    : 7	(unsigned)
    <5d7>   DW_AT_name        : (indirect string, offset: 0x149e3): unsigned int
 <1><5db>: Abbrev Number: 3 (DW_TAG_base_type)
    <5dc>   DW_AT_byte_size   : 8
    <5dd>   DW_AT_encoding    : 5	(signed)
    <5de>   DW_AT_name        : (indirect string, offset: 0x745fe): long long int
 <1><5e2>: Abbrev Number: 3 (DW_TAG_base_type)
    <5e3>   DW_AT_byte_size   : 8
    <5e4>   DW_AT_encoding    : 4	(float)
    <5e5>   DW_AT_name        : (indirect string, offset: 0xffd83): long double
 <1><5e9>: Abbrev Number: 3 (DW_TAG_base_type)
    <5ea>   DW_AT_byte_size   : 1
    <5eb>   DW_AT_encoding    : 6	(signed char)
    <5ec>   DW_AT_name        : (indirect string, offset: 0x10b5e9): signed char
 <1><5f0>: Abbrev Number: 4 (DW_TAG_typedef)
    <5f1>   DW_AT_name        : (indirect string, offset: 0x10247f): __uint8_t
    <5f5>   DW_AT_decl_file   : 2
    <5f6>   DW_AT_decl_line   : 43
    <5f7>   DW_AT_decl_column : 24
    <5f8>   DW_AT_type        : <0x5fc>
 <1><5fc>: Abbrev Number: 3 (DW_TAG_base_type)
    <5fd>   DW_AT_byte_size   : 1
    <5fe>   DW_AT_encoding    : 8	(unsigned char)
    <5ff>   DW_AT_name        : (indirect string, offset: 0x100a9d): unsigned char
 <1><603>: Abbrev Number: 3 (DW_TAG_base_type)
    <604>   DW_AT_byte_size   : 2
    <605>   DW_AT_encoding    : 5	(signed)
    <606>   DW_AT_name        : (indirect string, offset: 0xbd259): short int
 <1><60a>: Abbrev Number: 4 (DW_TAG_typedef)
    <60b>   DW_AT_name        : (indirect string, offset: 0x108dfc): __uint16_t
    <60f>   DW_AT_decl_file   : 2
    <610>   DW_AT_decl_line   : 57
    <611>   DW_AT_decl_column : 25
    <612>   DW_AT_type        : <0x616>
 <1><616>: Abbrev Number: 3 (DW_TAG_base_type)
    <617>   DW_AT_byte_size   : 2
    <618>   DW_AT_encoding    : 7	(unsigned)
    <619>   DW_AT_name        : (indirect string, offset: 0xf379b): short unsigned int
 <1><61d>: Abbrev Number: 3 (DW_TAG_base_type)
    <61e>   DW_AT_byte_size   : 4
    <61f>   DW_AT_encoding    : 5	(signed)
    <620>   DW_AT_name        : (indirect string, offset: 0x155ad): long int
 <1><624>: Abbrev Number: 4 (DW_TAG_typedef)
    <625>   DW_AT_name        : (indirect string, offset: 0xa2e91): __uint32_t
    <629>   DW_AT_decl_file   : 2
    <62a>   DW_AT_decl_line   : 79
    <62b>   DW_AT_decl_column : 25
    <62c>   DW_AT_type        : <0x630>
 <1><630>: Abbrev Number: 3 (DW_TAG_base_type)
    <631>   DW_AT_byte_size   : 4
    <632>   DW_AT_encoding    : 7	(unsigned)
    <633>   DW_AT_name        : (indirect string, offset: 0x60cb9): long unsigned int
 <1><637>: Abbrev Number: 3 (DW_TAG_base_type)
    <638>   DW_AT_byte_size   : 8
    <639>   DW_AT_encoding    : 7	(unsigned)
    <63a>   DW_AT_name        : (indirect string, offset: 0x34cbc): long long unsigned int
 <1><63e>: Abbrev Number: 4 (DW_TAG_typedef)
    <63f>   DW_AT_name        : (indirect string, offset: 0x102481): uint8_t
    <643>   DW_AT_decl_file   : 3
    <644>   DW_AT_decl_line   : 24
    <645>   DW_AT_decl_column : 19
    <646>   DW_AT_type        : <0x5f0>
 <1><64a>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <64b>   DW_AT_type        : <0x63e>
 <1><64f>: Abbrev Number: 4 (DW_TAG_typedef)
    <650>   DW_AT_name        : (indirect string, offset: 0x107adc): uint16_t
    <654>   DW_AT_decl_file   : 3
    <655>   DW_AT_decl_line   : 36
    <656>   DW_AT_decl_column : 20
    <657>   DW_AT_type        : <0x60a>
 <1><65b>: Abbrev Number: 6 (DW_TAG_const_type)
    <65c>   DW_AT_type        : <0x64f>
 <1><660>: Abbrev Number: 4 (DW_TAG_typedef)
    <661>   DW_AT_name        : (indirect string, offset: 0x107a66): uint32_t
    <665>   DW_AT_decl_file   : 3
    <666>   DW_AT_decl_line   : 48
    <667>   DW_AT_decl_column : 20
    <668>   DW_AT_type        : <0x624>
 <1><66c>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <66d>   DW_AT_type        : <0x660>
 <1><671>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <672>   DW_AT_byte_size   : 4
 <1><673>: Abbrev Number: 6 (DW_TAG_const_type)
    <674>   DW_AT_type        : <0x671>
 <1><678>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <679>   DW_AT_byte_size   : 4
    <67a>   DW_AT_type        : <0x67e>
 <1><67e>: Abbrev Number: 3 (DW_TAG_base_type)
    <67f>   DW_AT_byte_size   : 1
    <680>   DW_AT_encoding    : 8	(unsigned char)
    <681>   DW_AT_name        : (indirect string, offset: 0x102af9): char
 <1><685>: Abbrev Number: 6 (DW_TAG_const_type)
    <686>   DW_AT_type        : <0x67e>
 <1><68a>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <68b>   DW_AT_byte_size   : 4
    <68c>   DW_AT_type        : <0x5fc>
 <1><690>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <691>   DW_AT_byte_size   : 4
    <692>   DW_AT_type        : <0x685>
 <1><696>: Abbrev Number: 6 (DW_TAG_const_type)
    <697>   DW_AT_type        : <0x690>
 <1><69b>: Abbrev Number: 4 (DW_TAG_typedef)
    <69c>   DW_AT_name        : (indirect string, offset: 0x104b2b): TaskFunction_t
    <6a0>   DW_AT_decl_file   : 4
    <6a1>   DW_AT_decl_line   : 35
    <6a2>   DW_AT_decl_column : 16
    <6a3>   DW_AT_type        : <0x6a7>
 <1><6a7>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <6a8>   DW_AT_byte_size   : 4
    <6a9>   DW_AT_type        : <0x6ad>
 <1><6ad>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <6ae>   DW_AT_prototyped  : 1
    <6ae>   DW_AT_sibling     : <0x6b8>
 <2><6b2>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <6b3>   DW_AT_type        : <0x671>
 <2><6b7>: Abbrev Number: 0
 <1><6b8>: Abbrev Number: 4 (DW_TAG_typedef)
    <6b9>   DW_AT_name        : (indirect string, offset: 0x107b2c): StackType_t
    <6bd>   DW_AT_decl_file   : 5
    <6be>   DW_AT_decl_line   : 55
    <6bf>   DW_AT_decl_column : 24
    <6c0>   DW_AT_type        : <0x660>
 <1><6c4>: Abbrev Number: 4 (DW_TAG_typedef)
    <6c5>   DW_AT_name        : (indirect string, offset: 0xfed2f): BaseType_t
    <6c9>   DW_AT_decl_file   : 5
    <6ca>   DW_AT_decl_line   : 56
    <6cb>   DW_AT_decl_column : 14
    <6cc>   DW_AT_type        : <0x61d>
 <1><6d0>: Abbrev Number: 4 (DW_TAG_typedef)
    <6d1>   DW_AT_name        : (indirect string, offset: 0xfed2e): UBaseType_t
    <6d5>   DW_AT_decl_file   : 5
    <6d6>   DW_AT_decl_line   : 57
    <6d7>   DW_AT_decl_column : 23
    <6d8>   DW_AT_type        : <0x630>
 <1><6dc>: Abbrev Number: 4 (DW_TAG_typedef)
    <6dd>   DW_AT_name        : (indirect string, offset: 0x1059ef): TickType_t
    <6e1>   DW_AT_decl_file   : 5
    <6e2>   DW_AT_decl_line   : 63
    <6e3>   DW_AT_decl_column : 19
    <6e4>   DW_AT_type        : <0x660>
 <1><6e8>: Abbrev Number: 11 (DW_TAG_typedef)
    <6e9>   DW_AT_name        : (indirect string, offset: 0x107c8d): wint_t
    <6ed>   DW_AT_decl_file   : 6
    <6ee>   DW_AT_decl_line   : 350
    <6f0>   DW_AT_decl_column : 23
    <6f1>   DW_AT_type        : <0x5d4>
 <1><6f5>: Abbrev Number: 4 (DW_TAG_typedef)
    <6f6>   DW_AT_name        : (indirect string, offset: 0x1049d2): _off_t
    <6fa>   DW_AT_decl_file   : 7
    <6fb>   DW_AT_decl_line   : 46
    <6fc>   DW_AT_decl_column : 14
    <6fd>   DW_AT_type        : <0x61d>
 <1><701>: Abbrev Number: 4 (DW_TAG_typedef)
    <702>   DW_AT_name        : (indirect string, offset: 0x101778): _fpos_t
    <706>   DW_AT_decl_file   : 7
    <707>   DW_AT_decl_line   : 116
    <708>   DW_AT_decl_column : 14
    <709>   DW_AT_type        : <0x61d>
 <1><70d>: Abbrev Number: 12 (DW_TAG_union_type)
    <70e>   DW_AT_byte_size   : 4
    <70f>   DW_AT_decl_file   : 7
    <710>   DW_AT_decl_line   : 165
    <711>   DW_AT_decl_column : 3
    <712>   DW_AT_sibling     : <0x72f>
 <2><716>: Abbrev Number: 13 (DW_TAG_member)
    <717>   DW_AT_name        : (indirect string, offset: 0x1094e6): __wch
    <71b>   DW_AT_decl_file   : 7
    <71c>   DW_AT_decl_line   : 167
    <71d>   DW_AT_decl_column : 12
    <71e>   DW_AT_type        : <0x6e8>
 <2><722>: Abbrev Number: 13 (DW_TAG_member)
    <723>   DW_AT_name        : (indirect string, offset: 0x105303): __wchb
    <727>   DW_AT_decl_file   : 7
    <728>   DW_AT_decl_line   : 168
    <729>   DW_AT_decl_column : 19
    <72a>   DW_AT_type        : <0x72f>
 <2><72e>: Abbrev Number: 0
 <1><72f>: Abbrev Number: 14 (DW_TAG_array_type)
    <730>   DW_AT_type        : <0x5fc>
    <734>   DW_AT_sibling     : <0x73f>
 <2><738>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <739>   DW_AT_type        : <0x5d4>
    <73d>   DW_AT_upper_bound : 3
 <2><73e>: Abbrev Number: 0
 <1><73f>: Abbrev Number: 16 (DW_TAG_structure_type)
    <740>   DW_AT_byte_size   : 8
    <741>   DW_AT_decl_file   : 7
    <742>   DW_AT_decl_line   : 162
    <743>   DW_AT_decl_column : 9
    <744>   DW_AT_sibling     : <0x763>
 <2><748>: Abbrev Number: 17 (DW_TAG_member)
    <749>   DW_AT_name        : (indirect string, offset: 0x1022c5): __count
    <74d>   DW_AT_decl_file   : 7
    <74e>   DW_AT_decl_line   : 164
    <74f>   DW_AT_decl_column : 7
    <750>   DW_AT_type        : <0x5cd>
    <754>   DW_AT_data_member_location: 0
 <2><755>: Abbrev Number: 17 (DW_TAG_member)
    <756>   DW_AT_name        : (indirect string, offset: 0x105e5f): __value
    <75a>   DW_AT_decl_file   : 7
    <75b>   DW_AT_decl_line   : 169
    <75c>   DW_AT_decl_column : 5
    <75d>   DW_AT_type        : <0x70d>
    <761>   DW_AT_data_member_location: 4
 <2><762>: Abbrev Number: 0
 <1><763>: Abbrev Number: 4 (DW_TAG_typedef)
    <764>   DW_AT_name        : (indirect string, offset: 0x1054ac): _mbstate_t
    <768>   DW_AT_decl_file   : 7
    <769>   DW_AT_decl_line   : 170
    <76a>   DW_AT_decl_column : 3
    <76b>   DW_AT_type        : <0x73f>
 <1><76f>: Abbrev Number: 4 (DW_TAG_typedef)
    <770>   DW_AT_name        : (indirect string, offset: 0x109cfd): __ULong
    <774>   DW_AT_decl_file   : 8
    <775>   DW_AT_decl_line   : 22
    <776>   DW_AT_decl_column : 25
    <777>   DW_AT_type        : <0x630>
 <1><77b>: Abbrev Number: 4 (DW_TAG_typedef)
    <77c>   DW_AT_name        : (indirect string, offset: 0x105959): _LOCK_T
    <780>   DW_AT_decl_file   : 9
    <781>   DW_AT_decl_line   : 34
    <782>   DW_AT_decl_column : 25
    <783>   DW_AT_type        : <0x787>
 <1><787>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <788>   DW_AT_byte_size   : 4
    <789>   DW_AT_type        : <0x78d>
 <1><78d>: Abbrev Number: 18 (DW_TAG_structure_type)
    <78e>   DW_AT_name        : (indirect string, offset: 0x10037d): __lock
    <792>   DW_AT_declaration : 1
 <1><792>: Abbrev Number: 4 (DW_TAG_typedef)
    <793>   DW_AT_name        : (indirect string, offset: 0x104f55): _flock_t
    <797>   DW_AT_decl_file   : 8
    <798>   DW_AT_decl_line   : 35
    <799>   DW_AT_decl_column : 27
    <79a>   DW_AT_type        : <0x77b>
 <1><79e>: Abbrev Number: 19 (DW_TAG_structure_type)
    <79f>   DW_AT_name        : (indirect string, offset: 0x1031b5): _Bigint
    <7a3>   DW_AT_byte_size   : 24
    <7a4>   DW_AT_decl_file   : 8
    <7a5>   DW_AT_decl_line   : 52
    <7a6>   DW_AT_decl_column : 8
    <7a7>   DW_AT_sibling     : <0x7f8>
 <2><7ab>: Abbrev Number: 17 (DW_TAG_member)
    <7ac>   DW_AT_name        : (indirect string, offset: 0x106320): _next
    <7b0>   DW_AT_decl_file   : 8
    <7b1>   DW_AT_decl_line   : 54
    <7b2>   DW_AT_decl_column : 19
    <7b3>   DW_AT_type        : <0x7f8>
    <7b7>   DW_AT_data_member_location: 0
 <2><7b8>: Abbrev Number: 20 (DW_TAG_member)
    <7b9>   DW_AT_name        : _k
    <7bc>   DW_AT_decl_file   : 8
    <7bd>   DW_AT_decl_line   : 55
    <7be>   DW_AT_decl_column : 7
    <7bf>   DW_AT_type        : <0x5cd>
    <7c3>   DW_AT_data_member_location: 4
 <2><7c4>: Abbrev Number: 17 (DW_TAG_member)
    <7c5>   DW_AT_name        : (indirect string, offset: 0x107978): _maxwds
    <7c9>   DW_AT_decl_file   : 8
    <7ca>   DW_AT_decl_line   : 55
    <7cb>   DW_AT_decl_column : 11
    <7cc>   DW_AT_type        : <0x5cd>
    <7d0>   DW_AT_data_member_location: 8
 <2><7d1>: Abbrev Number: 17 (DW_TAG_member)
    <7d2>   DW_AT_name        : (indirect string, offset: 0x1055c2): _sign
    <7d6>   DW_AT_decl_file   : 8
    <7d7>   DW_AT_decl_line   : 55
    <7d8>   DW_AT_decl_column : 20
    <7d9>   DW_AT_type        : <0x5cd>
    <7dd>   DW_AT_data_member_location: 12
 <2><7de>: Abbrev Number: 17 (DW_TAG_member)
    <7df>   DW_AT_name        : (indirect string, offset: 0x1055bd): _wds
    <7e3>   DW_AT_decl_file   : 8
    <7e4>   DW_AT_decl_line   : 55
    <7e5>   DW_AT_decl_column : 27
    <7e6>   DW_AT_type        : <0x5cd>
    <7ea>   DW_AT_data_member_location: 16
 <2><7eb>: Abbrev Number: 20 (DW_TAG_member)
    <7ec>   DW_AT_name        : _x
    <7ef>   DW_AT_decl_file   : 8
    <7f0>   DW_AT_decl_line   : 56
    <7f1>   DW_AT_decl_column : 11
    <7f2>   DW_AT_type        : <0x7fe>
    <7f6>   DW_AT_data_member_location: 20
 <2><7f7>: Abbrev Number: 0
 <1><7f8>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <7f9>   DW_AT_byte_size   : 4
    <7fa>   DW_AT_type        : <0x79e>
 <1><7fe>: Abbrev Number: 14 (DW_TAG_array_type)
    <7ff>   DW_AT_type        : <0x76f>
    <803>   DW_AT_sibling     : <0x80e>
 <2><807>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <808>   DW_AT_type        : <0x5d4>
    <80c>   DW_AT_upper_bound : 0
 <2><80d>: Abbrev Number: 0
 <1><80e>: Abbrev Number: 19 (DW_TAG_structure_type)
    <80f>   DW_AT_name        : (indirect string, offset: 0x10221f): __tm
    <813>   DW_AT_byte_size   : 36
    <814>   DW_AT_decl_file   : 8
    <815>   DW_AT_decl_line   : 60
    <816>   DW_AT_decl_column : 8
    <817>   DW_AT_sibling     : <0x891>
 <2><81b>: Abbrev Number: 17 (DW_TAG_member)
    <81c>   DW_AT_name        : (indirect string, offset: 0x108e2a): __tm_sec
    <820>   DW_AT_decl_file   : 8
    <821>   DW_AT_decl_line   : 62
    <822>   DW_AT_decl_column : 9
    <823>   DW_AT_type        : <0x5cd>
    <827>   DW_AT_data_member_location: 0
 <2><828>: Abbrev Number: 17 (DW_TAG_member)
    <829>   DW_AT_name        : (indirect string, offset: 0xfeceb): __tm_min
    <82d>   DW_AT_decl_file   : 8
    <82e>   DW_AT_decl_line   : 63
    <82f>   DW_AT_decl_column : 9
    <830>   DW_AT_type        : <0x5cd>
    <834>   DW_AT_data_member_location: 4
 <2><835>: Abbrev Number: 17 (DW_TAG_member)
    <836>   DW_AT_name        : (indirect string, offset: 0x1015a6): __tm_hour
    <83a>   DW_AT_decl_file   : 8
    <83b>   DW_AT_decl_line   : 64
    <83c>   DW_AT_decl_column : 9
    <83d>   DW_AT_type        : <0x5cd>
    <841>   DW_AT_data_member_location: 8
 <2><842>: Abbrev Number: 17 (DW_TAG_member)
    <843>   DW_AT_name        : (indirect string, offset: 0x106223): __tm_mday
    <847>   DW_AT_decl_file   : 8
    <848>   DW_AT_decl_line   : 65
    <849>   DW_AT_decl_column : 9
    <84a>   DW_AT_type        : <0x5cd>
    <84e>   DW_AT_data_member_location: 12
 <2><84f>: Abbrev Number: 17 (DW_TAG_member)
    <850>   DW_AT_name        : (indirect string, offset: 0xfee05): __tm_mon
    <854>   DW_AT_decl_file   : 8
    <855>   DW_AT_decl_line   : 66
    <856>   DW_AT_decl_column : 9
    <857>   DW_AT_type        : <0x5cd>
    <85b>   DW_AT_data_member_location: 16
 <2><85c>: Abbrev Number: 17 (DW_TAG_member)
    <85d>   DW_AT_name        : (indirect string, offset: 0x10a672): __tm_year
    <861>   DW_AT_decl_file   : 8
    <862>   DW_AT_decl_line   : 67
    <863>   DW_AT_decl_column : 9
    <864>   DW_AT_type        : <0x5cd>
    <868>   DW_AT_data_member_location: 20
 <2><869>: Abbrev Number: 17 (DW_TAG_member)
    <86a>   DW_AT_name        : (indirect string, offset: 0x1041f9): __tm_wday
    <86e>   DW_AT_decl_file   : 8
    <86f>   DW_AT_decl_line   : 68
    <870>   DW_AT_decl_column : 9
    <871>   DW_AT_type        : <0x5cd>
    <875>   DW_AT_data_member_location: 24
 <2><876>: Abbrev Number: 17 (DW_TAG_member)
    <877>   DW_AT_name        : (indirect string, offset: 0x10966b): __tm_yday
    <87b>   DW_AT_decl_file   : 8
    <87c>   DW_AT_decl_line   : 69
    <87d>   DW_AT_decl_column : 9
    <87e>   DW_AT_type        : <0x5cd>
    <882>   DW_AT_data_member_location: 28
 <2><883>: Abbrev Number: 17 (DW_TAG_member)
    <884>   DW_AT_name        : (indirect string, offset: 0x109e95): __tm_isdst
    <888>   DW_AT_decl_file   : 8
    <889>   DW_AT_decl_line   : 70
    <88a>   DW_AT_decl_column : 9
    <88b>   DW_AT_type        : <0x5cd>
    <88f>   DW_AT_data_member_location: 32
 <2><890>: Abbrev Number: 0
 <1><891>: Abbrev Number: 19 (DW_TAG_structure_type)
    <892>   DW_AT_name        : (indirect string, offset: 0x106fa5): __sbuf
    <896>   DW_AT_byte_size   : 8
    <897>   DW_AT_decl_file   : 8
    <898>   DW_AT_decl_line   : 122
    <899>   DW_AT_decl_column : 8
    <89a>   DW_AT_sibling     : <0x8b9>
 <2><89e>: Abbrev Number: 17 (DW_TAG_member)
    <89f>   DW_AT_name        : (indirect string, offset: 0x102d3d): _base
    <8a3>   DW_AT_decl_file   : 8
    <8a4>   DW_AT_decl_line   : 123
    <8a5>   DW_AT_decl_column : 17
    <8a6>   DW_AT_type        : <0x68a>
    <8aa>   DW_AT_data_member_location: 0
 <2><8ab>: Abbrev Number: 17 (DW_TAG_member)
    <8ac>   DW_AT_name        : (indirect string, offset: 0x104bb2): _size
    <8b0>   DW_AT_decl_file   : 8
    <8b1>   DW_AT_decl_line   : 124
    <8b2>   DW_AT_decl_column : 6
    <8b3>   DW_AT_type        : <0x5cd>
    <8b7>   DW_AT_data_member_location: 4
 <2><8b8>: Abbrev Number: 0
 <1><8b9>: Abbrev Number: 21 (DW_TAG_structure_type)
    <8ba>   DW_AT_name        : (indirect string, offset: 0x116bdd): _reent
    <8be>   DW_AT_byte_size   : 96
    <8bf>   DW_AT_decl_file   : 8
    <8c0>   DW_AT_decl_line   : 377
    <8c2>   DW_AT_decl_column : 8
    <8c3>   DW_AT_sibling     : <0x9fc>
 <2><8c7>: Abbrev Number: 22 (DW_TAG_member)
    <8c8>   DW_AT_name        : (indirect string, offset: 0x106266): _errno
    <8cc>   DW_AT_decl_file   : 8
    <8cd>   DW_AT_decl_line   : 381
    <8cf>   DW_AT_decl_column : 7
    <8d0>   DW_AT_type        : <0x5cd>
    <8d4>   DW_AT_data_member_location: 0
 <2><8d5>: Abbrev Number: 22 (DW_TAG_member)
    <8d6>   DW_AT_name        : (indirect string, offset: 0x11608f): _stdin
    <8da>   DW_AT_decl_file   : 8
    <8db>   DW_AT_decl_line   : 386
    <8dd>   DW_AT_decl_column : 11
    <8de>   DW_AT_type        : <0xc37>
    <8e2>   DW_AT_data_member_location: 4
 <2><8e3>: Abbrev Number: 22 (DW_TAG_member)
    <8e4>   DW_AT_name        : (indirect string, offset: 0x116a89): _stdout
    <8e8>   DW_AT_decl_file   : 8
    <8e9>   DW_AT_decl_line   : 386
    <8eb>   DW_AT_decl_column : 20
    <8ec>   DW_AT_type        : <0xc37>
    <8f0>   DW_AT_data_member_location: 8
 <2><8f1>: Abbrev Number: 22 (DW_TAG_member)
    <8f2>   DW_AT_name        : (indirect string, offset: 0x116a32): _stderr
    <8f6>   DW_AT_decl_file   : 8
    <8f7>   DW_AT_decl_line   : 386
    <8f9>   DW_AT_decl_column : 30
    <8fa>   DW_AT_type        : <0xc37>
    <8fe>   DW_AT_data_member_location: 12
 <2><8ff>: Abbrev Number: 22 (DW_TAG_member)
    <900>   DW_AT_name        : (indirect string, offset: 0x106a72): _inc
    <904>   DW_AT_decl_file   : 8
    <905>   DW_AT_decl_line   : 388
    <907>   DW_AT_decl_column : 8
    <908>   DW_AT_type        : <0x5cd>
    <90c>   DW_AT_data_member_location: 16
 <2><90d>: Abbrev Number: 22 (DW_TAG_member)
    <90e>   DW_AT_name        : (indirect string, offset: 0x108762): _emergency
    <912>   DW_AT_decl_file   : 8
    <913>   DW_AT_decl_line   : 390
    <915>   DW_AT_decl_column : 9
    <916>   DW_AT_type        : <0x678>
    <91a>   DW_AT_data_member_location: 20
 <2><91b>: Abbrev Number: 22 (DW_TAG_member)
    <91c>   DW_AT_name        : (indirect string, offset: 0x101111): __sdidinit
    <920>   DW_AT_decl_file   : 8
    <921>   DW_AT_decl_line   : 392
    <923>   DW_AT_decl_column : 7
    <924>   DW_AT_type        : <0x5cd>
    <928>   DW_AT_data_member_location: 24
 <2><929>: Abbrev Number: 22 (DW_TAG_member)
    <92a>   DW_AT_name        : (indirect string, offset: 0xffd33): _unspecified_locale_info
    <92e>   DW_AT_decl_file   : 8
    <92f>   DW_AT_decl_line   : 394
    <931>   DW_AT_decl_column : 7
    <932>   DW_AT_type        : <0x5cd>
    <936>   DW_AT_data_member_location: 28
 <2><937>: Abbrev Number: 22 (DW_TAG_member)
    <938>   DW_AT_name        : (indirect string, offset: 0x109bda): _locale
    <93c>   DW_AT_decl_file   : 8
    <93d>   DW_AT_decl_line   : 395
    <93f>   DW_AT_decl_column : 22
    <940>   DW_AT_type        : <0xd9f>
    <944>   DW_AT_data_member_location: 32
 <2><945>: Abbrev Number: 23 (DW_TAG_member)
    <946>   DW_AT_name        : _mp
    <94a>   DW_AT_decl_file   : 8
    <94b>   DW_AT_decl_line   : 397
    <94d>   DW_AT_decl_column : 18
    <94e>   DW_AT_type        : <0xda5>
    <952>   DW_AT_data_member_location: 36
 <2><953>: Abbrev Number: 22 (DW_TAG_member)
    <954>   DW_AT_name        : (indirect string, offset: 0x100a90): __cleanup
    <958>   DW_AT_decl_file   : 8
    <959>   DW_AT_decl_line   : 399
    <95b>   DW_AT_decl_column : 10
    <95c>   DW_AT_type        : <0xdb6>
    <960>   DW_AT_data_member_location: 40
 <2><961>: Abbrev Number: 22 (DW_TAG_member)
    <962>   DW_AT_name        : (indirect string, offset: 0x101ca4): _gamma_signgam
    <966>   DW_AT_decl_file   : 8
    <967>   DW_AT_decl_line   : 401
    <969>   DW_AT_decl_column : 7
    <96a>   DW_AT_type        : <0x5cd>
    <96e>   DW_AT_data_member_location: 44
 <2><96f>: Abbrev Number: 22 (DW_TAG_member)
    <970>   DW_AT_name        : (indirect string, offset: 0x108c44): _cvtlen
    <974>   DW_AT_decl_file   : 8
    <975>   DW_AT_decl_line   : 404
    <977>   DW_AT_decl_column : 7
    <978>   DW_AT_type        : <0x5cd>
    <97c>   DW_AT_data_member_location: 48
 <2><97d>: Abbrev Number: 22 (DW_TAG_member)
    <97e>   DW_AT_name        : (indirect string, offset: 0x104992): _cvtbuf
    <982>   DW_AT_decl_file   : 8
    <983>   DW_AT_decl_line   : 405
    <985>   DW_AT_decl_column : 9
    <986>   DW_AT_type        : <0x678>
    <98a>   DW_AT_data_member_location: 52
 <2><98b>: Abbrev Number: 22 (DW_TAG_member)
    <98c>   DW_AT_name        : (indirect string, offset: 0x107df0): _r48
    <990>   DW_AT_decl_file   : 8
    <991>   DW_AT_decl_line   : 407
    <993>   DW_AT_decl_column : 19
    <994>   DW_AT_type        : <0xdbc>
    <998>   DW_AT_data_member_location: 56
 <2><999>: Abbrev Number: 22 (DW_TAG_member)
    <99a>   DW_AT_name        : (indirect string, offset: 0x108fe4): _localtime_buf
    <99e>   DW_AT_decl_file   : 8
    <99f>   DW_AT_decl_line   : 408
    <9a1>   DW_AT_decl_column : 16
    <9a2>   DW_AT_type        : <0xdc2>
    <9a6>   DW_AT_data_member_location: 60
 <2><9a7>: Abbrev Number: 22 (DW_TAG_member)
    <9a8>   DW_AT_name        : (indirect string, offset: 0x1017f1): _asctime_buf
    <9ac>   DW_AT_decl_file   : 8
    <9ad>   DW_AT_decl_line   : 409
    <9af>   DW_AT_decl_column : 9
    <9b0>   DW_AT_type        : <0x678>
    <9b4>   DW_AT_data_member_location: 64
 <2><9b5>: Abbrev Number: 22 (DW_TAG_member)
    <9b6>   DW_AT_name        : (indirect string, offset: 0x101363): _sig_func
    <9ba>   DW_AT_decl_file   : 8
    <9bb>   DW_AT_decl_line   : 412
    <9bd>   DW_AT_decl_column : 12
    <9be>   DW_AT_type        : <0xdd3>
    <9c2>   DW_AT_data_member_location: 68
 <2><9c3>: Abbrev Number: 22 (DW_TAG_member)
    <9c4>   DW_AT_name        : (indirect string, offset: 0x107939): __sglue
    <9c8>   DW_AT_decl_file   : 8
    <9c9>   DW_AT_decl_line   : 420
    <9cb>   DW_AT_decl_column : 16
    <9cc>   DW_AT_type        : <0xbf8>
    <9d0>   DW_AT_data_member_location: 72
 <2><9d1>: Abbrev Number: 22 (DW_TAG_member)
    <9d2>   DW_AT_name        : (indirect string, offset: 0x10208d): __sf
    <9d6>   DW_AT_decl_file   : 8
    <9d7>   DW_AT_decl_line   : 421
    <9d9>   DW_AT_decl_column : 11
    <9da>   DW_AT_type        : <0xc37>
    <9de>   DW_AT_data_member_location: 84
 <2><9df>: Abbrev Number: 22 (DW_TAG_member)
    <9e0>   DW_AT_name        : (indirect string, offset: 0x10485b): _misc
    <9e4>   DW_AT_decl_file   : 8
    <9e5>   DW_AT_decl_line   : 422
    <9e7>   DW_AT_decl_column : 23
    <9e8>   DW_AT_type        : <0xddf>
    <9ec>   DW_AT_data_member_location: 88
 <2><9ed>: Abbrev Number: 22 (DW_TAG_member)
    <9ee>   DW_AT_name        : (indirect string, offset: 0x1067b4): _signal_buf
    <9f2>   DW_AT_decl_file   : 8
    <9f3>   DW_AT_decl_line   : 423
    <9f5>   DW_AT_decl_column : 9
    <9f6>   DW_AT_type        : <0x678>
    <9fa>   DW_AT_data_member_location: 92
 <2><9fb>: Abbrev Number: 0
 <1><9fc>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <9fd>   DW_AT_byte_size   : 4
    <9fe>   DW_AT_type        : <0x8b9>
 <1><a02>: Abbrev Number: 19 (DW_TAG_structure_type)
    <a03>   DW_AT_name        : (indirect string, offset: 0x1082f4): __sFILE
    <a07>   DW_AT_byte_size   : 104
    <a08>   DW_AT_decl_file   : 8
    <a09>   DW_AT_decl_line   : 186
    <a0a>   DW_AT_decl_column : 8
    <a0b>   DW_AT_sibling     : <0xb45>
 <2><a0f>: Abbrev Number: 20 (DW_TAG_member)
    <a10>   DW_AT_name        : _p
    <a13>   DW_AT_decl_file   : 8
    <a14>   DW_AT_decl_line   : 187
    <a15>   DW_AT_decl_column : 18
    <a16>   DW_AT_type        : <0x68a>
    <a1a>   DW_AT_data_member_location: 0
 <2><a1b>: Abbrev Number: 20 (DW_TAG_member)
    <a1c>   DW_AT_name        : _r
    <a1f>   DW_AT_decl_file   : 8
    <a20>   DW_AT_decl_line   : 188
    <a21>   DW_AT_decl_column : 7
    <a22>   DW_AT_type        : <0x5cd>
    <a26>   DW_AT_data_member_location: 4
 <2><a27>: Abbrev Number: 20 (DW_TAG_member)
    <a28>   DW_AT_name        : _w
    <a2b>   DW_AT_decl_file   : 8
    <a2c>   DW_AT_decl_line   : 189
    <a2d>   DW_AT_decl_column : 7
    <a2e>   DW_AT_type        : <0x5cd>
    <a32>   DW_AT_data_member_location: 8
 <2><a33>: Abbrev Number: 17 (DW_TAG_member)
    <a34>   DW_AT_name        : (indirect string, offset: 0x1048ff): _flags
    <a38>   DW_AT_decl_file   : 8
    <a39>   DW_AT_decl_line   : 190
    <a3a>   DW_AT_decl_column : 9
    <a3b>   DW_AT_type        : <0x603>
    <a3f>   DW_AT_data_member_location: 12
 <2><a40>: Abbrev Number: 17 (DW_TAG_member)
    <a41>   DW_AT_name        : (indirect string, offset: 0x1069d8): _file
    <a45>   DW_AT_decl_file   : 8
    <a46>   DW_AT_decl_line   : 191
    <a47>   DW_AT_decl_column : 9
    <a48>   DW_AT_type        : <0x603>
    <a4c>   DW_AT_data_member_location: 14
 <2><a4d>: Abbrev Number: 20 (DW_TAG_member)
    <a4e>   DW_AT_name        : _bf
    <a52>   DW_AT_decl_file   : 8
    <a53>   DW_AT_decl_line   : 192
    <a54>   DW_AT_decl_column : 17
    <a55>   DW_AT_type        : <0x891>
    <a59>   DW_AT_data_member_location: 16
 <2><a5a>: Abbrev Number: 17 (DW_TAG_member)
    <a5b>   DW_AT_name        : (indirect string, offset: 0x104940): _lbfsize
    <a5f>   DW_AT_decl_file   : 8
    <a60>   DW_AT_decl_line   : 193
    <a61>   DW_AT_decl_column : 7
    <a62>   DW_AT_type        : <0x5cd>
    <a66>   DW_AT_data_member_location: 24
 <2><a67>: Abbrev Number: 17 (DW_TAG_member)
    <a68>   DW_AT_name        : (indirect string, offset: 0x11397e): _data
    <a6c>   DW_AT_decl_file   : 8
    <a6d>   DW_AT_decl_line   : 196
    <a6e>   DW_AT_decl_column : 18
    <a6f>   DW_AT_type        : <0x9fc>
    <a73>   DW_AT_data_member_location: 28
 <2><a74>: Abbrev Number: 17 (DW_TAG_member)
    <a75>   DW_AT_name        : (indirect string, offset: 0x109cd0): _cookie
    <a79>   DW_AT_decl_file   : 8
    <a7a>   DW_AT_decl_line   : 200
    <a7b>   DW_AT_decl_column : 10
    <a7c>   DW_AT_type        : <0x671>
    <a80>   DW_AT_data_member_location: 32
 <2><a81>: Abbrev Number: 17 (DW_TAG_member)
    <a82>   DW_AT_name        : (indirect string, offset: 0x112700): _read
    <a86>   DW_AT_decl_file   : 8
    <a87>   DW_AT_decl_line   : 202
    <a88>   DW_AT_decl_column : 29
    <a89>   DW_AT_type        : <0xb63>
    <a8d>   DW_AT_data_member_location: 36
 <2><a8e>: Abbrev Number: 17 (DW_TAG_member)
    <a8f>   DW_AT_name        : (indirect string, offset: 0x113379): _write
    <a93>   DW_AT_decl_file   : 8
    <a94>   DW_AT_decl_line   : 204
    <a95>   DW_AT_decl_column : 29
    <a96>   DW_AT_type        : <0xb87>
    <a9a>   DW_AT_data_member_location: 40
 <2><a9b>: Abbrev Number: 17 (DW_TAG_member)
    <a9c>   DW_AT_name        : (indirect string, offset: 0x102536): _seek
    <aa0>   DW_AT_decl_file   : 8
    <aa1>   DW_AT_decl_line   : 207
    <aa2>   DW_AT_decl_column : 13
    <aa3>   DW_AT_type        : <0xbab>
    <aa7>   DW_AT_data_member_location: 44
 <2><aa8>: Abbrev Number: 17 (DW_TAG_member)
    <aa9>   DW_AT_name        : (indirect string, offset: 0x1096b8): _close
    <aad>   DW_AT_decl_file   : 8
    <aae>   DW_AT_decl_line   : 208
    <aaf>   DW_AT_decl_column : 9
    <ab0>   DW_AT_type        : <0xbc5>
    <ab4>   DW_AT_data_member_location: 48
 <2><ab5>: Abbrev Number: 20 (DW_TAG_member)
    <ab6>   DW_AT_name        : _ub
    <aba>   DW_AT_decl_file   : 8
    <abb>   DW_AT_decl_line   : 211
    <abc>   DW_AT_decl_column : 17
    <abd>   DW_AT_type        : <0x891>
    <ac1>   DW_AT_data_member_location: 52
 <2><ac2>: Abbrev Number: 20 (DW_TAG_member)
    <ac3>   DW_AT_name        : _up
    <ac7>   DW_AT_decl_file   : 8
    <ac8>   DW_AT_decl_line   : 212
    <ac9>   DW_AT_decl_column : 18
    <aca>   DW_AT_type        : <0x68a>
    <ace>   DW_AT_data_member_location: 60
 <2><acf>: Abbrev Number: 20 (DW_TAG_member)
    <ad0>   DW_AT_name        : _ur
    <ad4>   DW_AT_decl_file   : 8
    <ad5>   DW_AT_decl_line   : 213
    <ad6>   DW_AT_decl_column : 7
    <ad7>   DW_AT_type        : <0x5cd>
    <adb>   DW_AT_data_member_location: 64
 <2><adc>: Abbrev Number: 17 (DW_TAG_member)
    <add>   DW_AT_name        : (indirect string, offset: 0x10af54): _ubuf
    <ae1>   DW_AT_decl_file   : 8
    <ae2>   DW_AT_decl_line   : 216
    <ae3>   DW_AT_decl_column : 17
    <ae4>   DW_AT_type        : <0xbcb>
    <ae8>   DW_AT_data_member_location: 68
 <2><ae9>: Abbrev Number: 17 (DW_TAG_member)
    <aea>   DW_AT_name        : (indirect string, offset: 0x10711f): _nbuf
    <aee>   DW_AT_decl_file   : 8
    <aef>   DW_AT_decl_line   : 217
    <af0>   DW_AT_decl_column : 17
    <af1>   DW_AT_type        : <0xbdb>
    <af5>   DW_AT_data_member_location: 71
 <2><af6>: Abbrev Number: 20 (DW_TAG_member)
    <af7>   DW_AT_name        : _lb
    <afb>   DW_AT_decl_file   : 8
    <afc>   DW_AT_decl_line   : 220
    <afd>   DW_AT_decl_column : 17
    <afe>   DW_AT_type        : <0x891>
    <b02>   DW_AT_data_member_location: 72
 <2><b03>: Abbrev Number: 17 (DW_TAG_member)
    <b04>   DW_AT_name        : (indirect string, offset: 0x101d0b): _blksize
    <b08>   DW_AT_decl_file   : 8
    <b09>   DW_AT_decl_line   : 223
    <b0a>   DW_AT_decl_column : 7
    <b0b>   DW_AT_type        : <0x5cd>
    <b0f>   DW_AT_data_member_location: 80
 <2><b10>: Abbrev Number: 17 (DW_TAG_member)
    <b11>   DW_AT_name        : (indirect string, offset: 0x102ad5): _offset
    <b15>   DW_AT_decl_file   : 8
    <b16>   DW_AT_decl_line   : 224
    <b17>   DW_AT_decl_column : 10
    <b18>   DW_AT_type        : <0x6f5>
    <b1c>   DW_AT_data_member_location: 84
 <2><b1d>: Abbrev Number: 17 (DW_TAG_member)
    <b1e>   DW_AT_name        : (indirect string, offset: 0x10037e): _lock
    <b22>   DW_AT_decl_file   : 8
    <b23>   DW_AT_decl_line   : 231
    <b24>   DW_AT_decl_column : 12
    <b25>   DW_AT_type        : <0x792>
    <b29>   DW_AT_data_member_location: 88
 <2><b2a>: Abbrev Number: 17 (DW_TAG_member)
    <b2b>   DW_AT_name        : (indirect string, offset: 0x1001e3): _mbstate
    <b2f>   DW_AT_decl_file   : 8
    <b30>   DW_AT_decl_line   : 233
    <b31>   DW_AT_decl_column : 14
    <b32>   DW_AT_type        : <0x763>
    <b36>   DW_AT_data_member_location: 92
 <2><b37>: Abbrev Number: 17 (DW_TAG_member)
    <b38>   DW_AT_name        : (indirect string, offset: 0x10a250): _flags2
    <b3c>   DW_AT_decl_file   : 8
    <b3d>   DW_AT_decl_line   : 234
    <b3e>   DW_AT_decl_column : 9
    <b3f>   DW_AT_type        : <0x5cd>
    <b43>   DW_AT_data_member_location: 100
 <2><b44>: Abbrev Number: 0
 <1><b45>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <b46>   DW_AT_prototyped  : 1
    <b46>   DW_AT_type        : <0x5cd>
    <b4a>   DW_AT_sibling     : <0xb63>
 <2><b4e>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <b4f>   DW_AT_type        : <0x9fc>
 <2><b53>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <b54>   DW_AT_type        : <0x671>
 <2><b58>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <b59>   DW_AT_type        : <0x678>
 <2><b5d>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <b5e>   DW_AT_type        : <0x5cd>
 <2><b62>: Abbrev Number: 0
 <1><b63>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <b64>   DW_AT_byte_size   : 4
    <b65>   DW_AT_type        : <0xb45>
 <1><b69>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <b6a>   DW_AT_prototyped  : 1
    <b6a>   DW_AT_type        : <0x5cd>
    <b6e>   DW_AT_sibling     : <0xb87>
 <2><b72>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <b73>   DW_AT_type        : <0x9fc>
 <2><b77>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <b78>   DW_AT_type        : <0x671>
 <2><b7c>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <b7d>   DW_AT_type        : <0x690>
 <2><b81>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <b82>   DW_AT_type        : <0x5cd>
 <2><b86>: Abbrev Number: 0
 <1><b87>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <b88>   DW_AT_byte_size   : 4
    <b89>   DW_AT_type        : <0xb69>
 <1><b8d>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <b8e>   DW_AT_prototyped  : 1
    <b8e>   DW_AT_type        : <0x701>
    <b92>   DW_AT_sibling     : <0xbab>
 <2><b96>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <b97>   DW_AT_type        : <0x9fc>
 <2><b9b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <b9c>   DW_AT_type        : <0x671>
 <2><ba0>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ba1>   DW_AT_type        : <0x701>
 <2><ba5>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ba6>   DW_AT_type        : <0x5cd>
 <2><baa>: Abbrev Number: 0
 <1><bab>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <bac>   DW_AT_byte_size   : 4
    <bad>   DW_AT_type        : <0xb8d>
 <1><bb1>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <bb2>   DW_AT_prototyped  : 1
    <bb2>   DW_AT_type        : <0x5cd>
    <bb6>   DW_AT_sibling     : <0xbc5>
 <2><bba>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <bbb>   DW_AT_type        : <0x9fc>
 <2><bbf>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <bc0>   DW_AT_type        : <0x671>
 <2><bc4>: Abbrev Number: 0
 <1><bc5>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <bc6>   DW_AT_byte_size   : 4
    <bc7>   DW_AT_type        : <0xbb1>
 <1><bcb>: Abbrev Number: 14 (DW_TAG_array_type)
    <bcc>   DW_AT_type        : <0x5fc>
    <bd0>   DW_AT_sibling     : <0xbdb>
 <2><bd4>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <bd5>   DW_AT_type        : <0x5d4>
    <bd9>   DW_AT_upper_bound : 2
 <2><bda>: Abbrev Number: 0
 <1><bdb>: Abbrev Number: 14 (DW_TAG_array_type)
    <bdc>   DW_AT_type        : <0x5fc>
    <be0>   DW_AT_sibling     : <0xbeb>
 <2><be4>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <be5>   DW_AT_type        : <0x5d4>
    <be9>   DW_AT_upper_bound : 0
 <2><bea>: Abbrev Number: 0
 <1><beb>: Abbrev Number: 11 (DW_TAG_typedef)
    <bec>   DW_AT_name        : (indirect string, offset: 0x109b94): __FILE
    <bf0>   DW_AT_decl_file   : 8
    <bf1>   DW_AT_decl_line   : 292
    <bf3>   DW_AT_decl_column : 26
    <bf4>   DW_AT_type        : <0xa02>
 <1><bf8>: Abbrev Number: 21 (DW_TAG_structure_type)
    <bf9>   DW_AT_name        : (indirect string, offset: 0x108340): _glue
    <bfd>   DW_AT_byte_size   : 12
    <bfe>   DW_AT_decl_file   : 8
    <bff>   DW_AT_decl_line   : 296
    <c01>   DW_AT_decl_column : 8
    <c02>   DW_AT_sibling     : <0xc31>
 <2><c06>: Abbrev Number: 22 (DW_TAG_member)
    <c07>   DW_AT_name        : (indirect string, offset: 0x106320): _next
    <c0b>   DW_AT_decl_file   : 8
    <c0c>   DW_AT_decl_line   : 298
    <c0e>   DW_AT_decl_column : 17
    <c0f>   DW_AT_type        : <0xc31>
    <c13>   DW_AT_data_member_location: 0
 <2><c14>: Abbrev Number: 22 (DW_TAG_member)
    <c15>   DW_AT_name        : (indirect string, offset: 0x103711): _niobs
    <c19>   DW_AT_decl_file   : 8
    <c1a>   DW_AT_decl_line   : 299
    <c1c>   DW_AT_decl_column : 7
    <c1d>   DW_AT_type        : <0x5cd>
    <c21>   DW_AT_data_member_location: 4
 <2><c22>: Abbrev Number: 22 (DW_TAG_member)
    <c23>   DW_AT_name        : (indirect string, offset: 0x10521a): _iobs
    <c27>   DW_AT_decl_file   : 8
    <c28>   DW_AT_decl_line   : 300
    <c2a>   DW_AT_decl_column : 11
    <c2b>   DW_AT_type        : <0xc37>
    <c2f>   DW_AT_data_member_location: 8
 <2><c30>: Abbrev Number: 0
 <1><c31>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <c32>   DW_AT_byte_size   : 4
    <c33>   DW_AT_type        : <0xbf8>
 <1><c37>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <c38>   DW_AT_byte_size   : 4
    <c39>   DW_AT_type        : <0xbeb>
 <1><c3d>: Abbrev Number: 21 (DW_TAG_structure_type)
    <c3e>   DW_AT_name        : (indirect string, offset: 0x1031f2): _rand48
    <c42>   DW_AT_byte_size   : 24
    <c43>   DW_AT_decl_file   : 8
    <c44>   DW_AT_decl_line   : 324
    <c46>   DW_AT_decl_column : 8
    <c47>   DW_AT_sibling     : <0xc84>
 <2><c4b>: Abbrev Number: 22 (DW_TAG_member)
    <c4c>   DW_AT_name        : (indirect string, offset: 0x10b09c): _seed
    <c50>   DW_AT_decl_file   : 8
    <c51>   DW_AT_decl_line   : 325
    <c53>   DW_AT_decl_column : 18
    <c54>   DW_AT_type        : <0xc84>
    <c58>   DW_AT_data_member_location: 0
 <2><c59>: Abbrev Number: 22 (DW_TAG_member)
    <c5a>   DW_AT_name        : (indirect string, offset: 0xffc71): _mult
    <c5e>   DW_AT_decl_file   : 8
    <c5f>   DW_AT_decl_line   : 326
    <c61>   DW_AT_decl_column : 18
    <c62>   DW_AT_type        : <0xc84>
    <c66>   DW_AT_data_member_location: 6
 <2><c67>: Abbrev Number: 22 (DW_TAG_member)
    <c68>   DW_AT_name        : (indirect string, offset: 0x10ed57): _add
    <c6c>   DW_AT_decl_file   : 8
    <c6d>   DW_AT_decl_line   : 327
    <c6f>   DW_AT_decl_column : 18
    <c70>   DW_AT_type        : <0x616>
    <c74>   DW_AT_data_member_location: 12
 <2><c75>: Abbrev Number: 22 (DW_TAG_member)
    <c76>   DW_AT_name        : (indirect string, offset: 0x10631b): _rand_next
    <c7a>   DW_AT_decl_file   : 8
    <c7b>   DW_AT_decl_line   : 330
    <c7d>   DW_AT_decl_column : 36
    <c7e>   DW_AT_type        : <0x637>
    <c82>   DW_AT_data_member_location: 16
 <2><c83>: Abbrev Number: 0
 <1><c84>: Abbrev Number: 14 (DW_TAG_array_type)
    <c85>   DW_AT_type        : <0x616>
    <c89>   DW_AT_sibling     : <0xc94>
 <2><c8d>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <c8e>   DW_AT_type        : <0x5d4>
    <c92>   DW_AT_upper_bound : 2
 <2><c93>: Abbrev Number: 0
 <1><c94>: Abbrev Number: 21 (DW_TAG_structure_type)
    <c95>   DW_AT_name        : (indirect string, offset: 0x108161): _mprec
    <c99>   DW_AT_byte_size   : 16
    <c9a>   DW_AT_decl_file   : 8
    <c9b>   DW_AT_decl_line   : 349
    <c9d>   DW_AT_decl_column : 8
    <c9e>   DW_AT_sibling     : <0xcdb>
 <2><ca2>: Abbrev Number: 22 (DW_TAG_member)
    <ca3>   DW_AT_name        : (indirect string, offset: 0x10b5f5): _result
    <ca7>   DW_AT_decl_file   : 8
    <ca8>   DW_AT_decl_line   : 352
    <caa>   DW_AT_decl_column : 19
    <cab>   DW_AT_type        : <0x7f8>
    <caf>   DW_AT_data_member_location: 0
 <2><cb0>: Abbrev Number: 22 (DW_TAG_member)
    <cb1>   DW_AT_name        : (indirect string, offset: 0x1067c0): _result_k
    <cb5>   DW_AT_decl_file   : 8
    <cb6>   DW_AT_decl_line   : 353
    <cb8>   DW_AT_decl_column : 7
    <cb9>   DW_AT_type        : <0x5cd>
    <cbd>   DW_AT_data_member_location: 4
 <2><cbe>: Abbrev Number: 22 (DW_TAG_member)
    <cbf>   DW_AT_name        : (indirect string, offset: 0x104bc4): _p5s
    <cc3>   DW_AT_decl_file   : 8
    <cc4>   DW_AT_decl_line   : 354
    <cc6>   DW_AT_decl_column : 19
    <cc7>   DW_AT_type        : <0x7f8>
    <ccb>   DW_AT_data_member_location: 8
 <2><ccc>: Abbrev Number: 22 (DW_TAG_member)
    <ccd>   DW_AT_name        : (indirect string, offset: 0x105fe0): _freelist
    <cd1>   DW_AT_decl_file   : 8
    <cd2>   DW_AT_decl_line   : 355
    <cd4>   DW_AT_decl_column : 20
    <cd5>   DW_AT_type        : <0xcdb>
    <cd9>   DW_AT_data_member_location: 12
 <2><cda>: Abbrev Number: 0
 <1><cdb>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <cdc>   DW_AT_byte_size   : 4
    <cdd>   DW_AT_type        : <0x7f8>
 <1><ce1>: Abbrev Number: 21 (DW_TAG_structure_type)
    <ce2>   DW_AT_name        : (indirect string, offset: 0x104bb8): _misc_reent
    <ce6>   DW_AT_byte_size   : 80
    <ce7>   DW_AT_decl_file   : 8
    <ce8>   DW_AT_decl_line   : 359
    <cea>   DW_AT_decl_column : 8
    <ceb>   DW_AT_sibling     : <0xd8a>
 <2><cef>: Abbrev Number: 22 (DW_TAG_member)
    <cf0>   DW_AT_name        : (indirect string, offset: 0x10a184): _strtok_last
    <cf4>   DW_AT_decl_file   : 8
    <cf5>   DW_AT_decl_line   : 362
    <cf7>   DW_AT_decl_column : 9
    <cf8>   DW_AT_type        : <0x678>
    <cfc>   DW_AT_data_member_location: 0
 <2><cfd>: Abbrev Number: 22 (DW_TAG_member)
    <cfe>   DW_AT_name        : (indirect string, offset: 0x1045e1): _mblen_state
    <d02>   DW_AT_decl_file   : 8
    <d03>   DW_AT_decl_line   : 363
    <d05>   DW_AT_decl_column : 14
    <d06>   DW_AT_type        : <0x763>
    <d0a>   DW_AT_data_member_location: 4
 <2><d0b>: Abbrev Number: 22 (DW_TAG_member)
    <d0c>   DW_AT_name        : (indirect string, offset: 0x10a191): _wctomb_state
    <d10>   DW_AT_decl_file   : 8
    <d11>   DW_AT_decl_line   : 364
    <d13>   DW_AT_decl_column : 14
    <d14>   DW_AT_type        : <0x763>
    <d18>   DW_AT_data_member_location: 12
 <2><d19>: Abbrev Number: 22 (DW_TAG_member)
    <d1a>   DW_AT_name        : (indirect string, offset: 0x1094ec): _mbtowc_state
    <d1e>   DW_AT_decl_file   : 8
    <d1f>   DW_AT_decl_line   : 365
    <d21>   DW_AT_decl_column : 14
    <d22>   DW_AT_type        : <0x763>
    <d26>   DW_AT_data_member_location: 20
 <2><d27>: Abbrev Number: 22 (DW_TAG_member)
    <d28>   DW_AT_name        : (indirect string, offset: 0x101c9a): _l64a_buf
    <d2c>   DW_AT_decl_file   : 8
    <d2d>   DW_AT_decl_line   : 366
    <d2f>   DW_AT_decl_column : 8
    <d30>   DW_AT_type        : <0xd8a>
    <d34>   DW_AT_data_member_location: 28
 <2><d35>: Abbrev Number: 22 (DW_TAG_member)
    <d36>   DW_AT_name        : (indirect string, offset: 0x109fdf): _getdate_err
    <d3a>   DW_AT_decl_file   : 8
    <d3b>   DW_AT_decl_line   : 367
    <d3d>   DW_AT_decl_column : 7
    <d3e>   DW_AT_type        : <0x5cd>
    <d42>   DW_AT_data_member_location: 36
 <2><d43>: Abbrev Number: 22 (DW_TAG_member)
    <d44>   DW_AT_name        : (indirect string, offset: 0x104df8): _mbrlen_state
    <d48>   DW_AT_decl_file   : 8
    <d49>   DW_AT_decl_line   : 368
    <d4b>   DW_AT_decl_column : 14
    <d4c>   DW_AT_type        : <0x763>
    <d50>   DW_AT_data_member_location: 40
 <2><d51>: Abbrev Number: 22 (DW_TAG_member)
    <d52>   DW_AT_name        : (indirect string, offset: 0x10a01b): _mbrtowc_state
    <d56>   DW_AT_decl_file   : 8
    <d57>   DW_AT_decl_line   : 369
    <d59>   DW_AT_decl_column : 14
    <d5a>   DW_AT_type        : <0x763>
    <d5e>   DW_AT_data_member_location: 48
 <2><d5f>: Abbrev Number: 22 (DW_TAG_member)
    <d60>   DW_AT_name        : (indirect string, offset: 0x10630a): _mbsrtowcs_state
    <d64>   DW_AT_decl_file   : 8
    <d65>   DW_AT_decl_line   : 370
    <d67>   DW_AT_decl_column : 14
    <d68>   DW_AT_type        : <0x763>
    <d6c>   DW_AT_data_member_location: 56
 <2><d6d>: Abbrev Number: 22 (DW_TAG_member)
    <d6e>   DW_AT_name        : (indirect string, offset: 0x1029da): _wcrtomb_state
    <d72>   DW_AT_decl_file   : 8
    <d73>   DW_AT_decl_line   : 371
    <d75>   DW_AT_decl_column : 14
    <d76>   DW_AT_type        : <0x763>
    <d7a>   DW_AT_data_member_location: 64
 <2><d7b>: Abbrev Number: 22 (DW_TAG_member)
    <d7c>   DW_AT_name        : (indirect string, offset: 0x105d26): _wcsrtombs_state
    <d80>   DW_AT_decl_file   : 8
    <d81>   DW_AT_decl_line   : 372
    <d83>   DW_AT_decl_column : 14
    <d84>   DW_AT_type        : <0x763>
    <d88>   DW_AT_data_member_location: 72
 <2><d89>: Abbrev Number: 0
 <1><d8a>: Abbrev Number: 14 (DW_TAG_array_type)
    <d8b>   DW_AT_type        : <0x67e>
    <d8f>   DW_AT_sibling     : <0xd9a>
 <2><d93>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <d94>   DW_AT_type        : <0x5d4>
    <d98>   DW_AT_upper_bound : 7
 <2><d99>: Abbrev Number: 0
 <1><d9a>: Abbrev Number: 18 (DW_TAG_structure_type)
    <d9b>   DW_AT_name        : (indirect string, offset: 0x10965b): __locale_t
    <d9f>   DW_AT_declaration : 1
 <1><d9f>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <da0>   DW_AT_byte_size   : 4
    <da1>   DW_AT_type        : <0xd9a>
 <1><da5>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <da6>   DW_AT_byte_size   : 4
    <da7>   DW_AT_type        : <0xc94>
 <1><dab>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <dac>   DW_AT_prototyped  : 1
    <dac>   DW_AT_sibling     : <0xdb6>
 <2><db0>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <db1>   DW_AT_type        : <0x9fc>
 <2><db5>: Abbrev Number: 0
 <1><db6>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <db7>   DW_AT_byte_size   : 4
    <db8>   DW_AT_type        : <0xdab>
 <1><dbc>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <dbd>   DW_AT_byte_size   : 4
    <dbe>   DW_AT_type        : <0xc3d>
 <1><dc2>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <dc3>   DW_AT_byte_size   : 4
    <dc4>   DW_AT_type        : <0x80e>
 <1><dc8>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <dc9>   DW_AT_prototyped  : 1
    <dc9>   DW_AT_sibling     : <0xdd3>
 <2><dcd>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <dce>   DW_AT_type        : <0x5cd>
 <2><dd2>: Abbrev Number: 0
 <1><dd3>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <dd4>   DW_AT_byte_size   : 4
    <dd5>   DW_AT_type        : <0xdd9>
 <1><dd9>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <dda>   DW_AT_byte_size   : 4
    <ddb>   DW_AT_type        : <0xdc8>
 <1><ddf>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <de0>   DW_AT_byte_size   : 4
    <de1>   DW_AT_type        : <0xce1>
 <1><de5>: Abbrev Number: 21 (DW_TAG_structure_type)
    <de6>   DW_AT_name        : (indirect string, offset: 0x1090af): xSTATIC_LIST_ITEM
    <dea>   DW_AT_byte_size   : 20
    <deb>   DW_AT_decl_file   : 10
    <dec>   DW_AT_decl_line   : 1061
    <dee>   DW_AT_decl_column : 8
    <def>   DW_AT_sibling     : <0xe10>
 <2><df3>: Abbrev Number: 22 (DW_TAG_member)
    <df4>   DW_AT_name        : (indirect string, offset: 0x1116ee): xDummy2
    <df8>   DW_AT_decl_file   : 10
    <df9>   DW_AT_decl_line   : 1066
    <dfb>   DW_AT_decl_column : 13
    <dfc>   DW_AT_type        : <0x6dc>
    <e00>   DW_AT_data_member_location: 0
 <2><e01>: Abbrev Number: 22 (DW_TAG_member)
    <e02>   DW_AT_name        : (indirect string, offset: 0x10354d): pvDummy3
    <e06>   DW_AT_decl_file   : 10
    <e07>   DW_AT_decl_line   : 1067
    <e09>   DW_AT_decl_column : 8
    <e0a>   DW_AT_type        : <0xe10>
    <e0e>   DW_AT_data_member_location: 4
 <2><e0f>: Abbrev Number: 0
 <1><e10>: Abbrev Number: 14 (DW_TAG_array_type)
    <e11>   DW_AT_type        : <0x671>
    <e15>   DW_AT_sibling     : <0xe20>
 <2><e19>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <e1a>   DW_AT_type        : <0x5d4>
    <e1e>   DW_AT_upper_bound : 3
 <2><e1f>: Abbrev Number: 0
 <1><e20>: Abbrev Number: 11 (DW_TAG_typedef)
    <e21>   DW_AT_name        : (indirect string, offset: 0x10808a): StaticListItem_t
    <e25>   DW_AT_decl_file   : 10
    <e26>   DW_AT_decl_line   : 1072
    <e28>   DW_AT_decl_column : 34
    <e29>   DW_AT_type        : <0xde5>
 <1><e2d>: Abbrev Number: 21 (DW_TAG_structure_type)
    <e2e>   DW_AT_name        : (indirect string, offset: 0x104b85): xSTATIC_TCB
    <e32>   DW_AT_byte_size   : 180
    <e33>   DW_AT_decl_file   : 10
    <e34>   DW_AT_decl_line   : 1112
    <e36>   DW_AT_decl_column : 16
    <e37>   DW_AT_sibling     : <0xec8>
 <2><e3b>: Abbrev Number: 22 (DW_TAG_member)
    <e3c>   DW_AT_name        : (indirect string, offset: 0x101344): pxDummy1
    <e40>   DW_AT_decl_file   : 10
    <e41>   DW_AT_decl_line   : 1114
    <e43>   DW_AT_decl_column : 11
    <e44>   DW_AT_type        : <0x671>
    <e48>   DW_AT_data_member_location: 0
 <2><e49>: Abbrev Number: 22 (DW_TAG_member)
    <e4a>   DW_AT_name        : (indirect string, offset: 0x101158): xDummy3
    <e4e>   DW_AT_decl_file   : 10
    <e4f>   DW_AT_decl_line   : 1118
    <e51>   DW_AT_decl_column : 19
    <e52>   DW_AT_type        : <0xec8>
    <e56>   DW_AT_data_member_location: 4
 <2><e57>: Abbrev Number: 22 (DW_TAG_member)
    <e58>   DW_AT_name        : (indirect string, offset: 0x100595): uxDummy5
    <e5c>   DW_AT_decl_file   : 10
    <e5d>   DW_AT_decl_line   : 1119
    <e5f>   DW_AT_decl_column : 16
    <e60>   DW_AT_type        : <0x6d0>
    <e64>   DW_AT_data_member_location: 44
 <2><e65>: Abbrev Number: 22 (DW_TAG_member)
    <e66>   DW_AT_name        : (indirect string, offset: 0x10134d): pxDummy6
    <e6a>   DW_AT_decl_file   : 10
    <e6b>   DW_AT_decl_line   : 1120
    <e6d>   DW_AT_decl_column : 11
    <e6e>   DW_AT_type        : <0x671>
    <e72>   DW_AT_data_member_location: 48
 <2><e73>: Abbrev Number: 22 (DW_TAG_member)
    <e74>   DW_AT_name        : (indirect string, offset: 0x106a69): ucDummy7
    <e78>   DW_AT_decl_file   : 10
    <e79>   DW_AT_decl_line   : 1121
    <e7b>   DW_AT_decl_column : 13
    <e7c>   DW_AT_type        : <0xed8>
    <e80>   DW_AT_data_member_location: 52
 <2><e81>: Abbrev Number: 22 (DW_TAG_member)
    <e82>   DW_AT_name        : (indirect string, offset: 0x101717): uxDummy12
    <e86>   DW_AT_decl_file   : 10
    <e87>   DW_AT_decl_line   : 1132
    <e89>   DW_AT_decl_column : 16
    <e8a>   DW_AT_type        : <0xee8>
    <e8e>   DW_AT_data_member_location: 68
 <2><e8f>: Abbrev Number: 22 (DW_TAG_member)
    <e90>   DW_AT_name        : (indirect string, offset: 0x108a33): xDummy17
    <e94>   DW_AT_decl_file   : 10
    <e95>   DW_AT_decl_line   : 1144
    <e97>   DW_AT_decl_column : 17
    <e98>   DW_AT_type        : <0x8b9>
    <e9c>   DW_AT_data_member_location: 76
 <2><e9d>: Abbrev Number: 22 (DW_TAG_member)
    <e9e>   DW_AT_name        : (indirect string, offset: 0x100795): ulDummy18
    <ea2>   DW_AT_decl_file   : 10
    <ea3>   DW_AT_decl_line   : 1147
    <ea5>   DW_AT_decl_column : 14
    <ea6>   DW_AT_type        : <0x660>
    <eaa>   DW_AT_data_member_location: 172
 <2><eab>: Abbrev Number: 22 (DW_TAG_member)
    <eac>   DW_AT_name        : (indirect string, offset: 0x10292f): ucDummy19
    <eb0>   DW_AT_decl_file   : 10
    <eb1>   DW_AT_decl_line   : 1148
    <eb3>   DW_AT_decl_column : 13
    <eb4>   DW_AT_type        : <0x63e>
    <eb8>   DW_AT_data_member_location: 176
 <2><eb9>: Abbrev Number: 22 (DW_TAG_member)
    <eba>   DW_AT_name        : (indirect string, offset: 0x109f68): uxDummy20
    <ebe>   DW_AT_decl_file   : 10
    <ebf>   DW_AT_decl_line   : 1151
    <ec1>   DW_AT_decl_column : 13
    <ec2>   DW_AT_type        : <0x63e>
    <ec6>   DW_AT_data_member_location: 177
 <2><ec7>: Abbrev Number: 0
 <1><ec8>: Abbrev Number: 14 (DW_TAG_array_type)
    <ec9>   DW_AT_type        : <0xe20>
    <ecd>   DW_AT_sibling     : <0xed8>
 <2><ed1>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <ed2>   DW_AT_type        : <0x5d4>
    <ed6>   DW_AT_upper_bound : 1
 <2><ed7>: Abbrev Number: 0
 <1><ed8>: Abbrev Number: 14 (DW_TAG_array_type)
    <ed9>   DW_AT_type        : <0x63e>
    <edd>   DW_AT_sibling     : <0xee8>
 <2><ee1>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <ee2>   DW_AT_type        : <0x5d4>
    <ee6>   DW_AT_upper_bound : 15
 <2><ee7>: Abbrev Number: 0
 <1><ee8>: Abbrev Number: 14 (DW_TAG_array_type)
    <ee9>   DW_AT_type        : <0x6d0>
    <eed>   DW_AT_sibling     : <0xef8>
 <2><ef1>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <ef2>   DW_AT_type        : <0x5d4>
    <ef6>   DW_AT_upper_bound : 1
 <2><ef7>: Abbrev Number: 0
 <1><ef8>: Abbrev Number: 11 (DW_TAG_typedef)
    <ef9>   DW_AT_name        : (indirect string, offset: 0x107785): StaticTask_t
    <efd>   DW_AT_decl_file   : 10
    <efe>   DW_AT_decl_line   : 1160
    <f00>   DW_AT_decl_column : 3
    <f01>   DW_AT_type        : <0xe2d>
 <1><f05>: Abbrev Number: 4 (DW_TAG_typedef)
    <f06>   DW_AT_name        : (indirect string, offset: 0x1098b5): TaskHandle_t
    <f0a>   DW_AT_decl_file   : 11
    <f0b>   DW_AT_decl_line   : 70
    <f0c>   DW_AT_decl_column : 37
    <f0d>   DW_AT_type        : <0xf11>
 <1><f11>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <f12>   DW_AT_byte_size   : 4
    <f13>   DW_AT_type        : <0xf17>
 <1><f17>: Abbrev Number: 18 (DW_TAG_structure_type)
    <f18>   DW_AT_name        : (indirect string, offset: 0x10949a): tskTaskControlBlock
    <f1c>   DW_AT_declaration : 1
 <1><f1c>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <f1d>   DW_AT_byte_size   : 4
    <f1e>   DW_AT_type        : <0x6b8>
 <1><f22>: Abbrev Number: 25 (DW_TAG_structure_type)
    <f23>   DW_AT_byte_size   : 44
    <f24>   DW_AT_decl_file   : 12
    <f25>   DW_AT_decl_line   : 600
    <f27>   DW_AT_decl_column : 9
    <f28>   DW_AT_sibling     : <0xfb9>
 <2><f2c>: Abbrev Number: 22 (DW_TAG_member)
    <f2d>   DW_AT_name        : (indirect string, offset: 0xfed28): MODER
    <f31>   DW_AT_decl_file   : 12
    <f32>   DW_AT_decl_line   : 602
    <f34>   DW_AT_decl_column : 17
    <f35>   DW_AT_type        : <0x66c>
    <f39>   DW_AT_data_member_location: 0
 <2><f3a>: Abbrev Number: 22 (DW_TAG_member)
    <f3b>   DW_AT_name        : (indirect string, offset: 0x1084a7): OTYPER
    <f3f>   DW_AT_decl_file   : 12
    <f40>   DW_AT_decl_line   : 603
    <f42>   DW_AT_decl_column : 17
    <f43>   DW_AT_type        : <0x66c>
    <f47>   DW_AT_data_member_location: 4
 <2><f48>: Abbrev Number: 22 (DW_TAG_member)
    <f49>   DW_AT_name        : (indirect string, offset: 0x1098ee): OSPEEDR
    <f4d>   DW_AT_decl_file   : 12
    <f4e>   DW_AT_decl_line   : 604
    <f50>   DW_AT_decl_column : 17
    <f51>   DW_AT_type        : <0x66c>
    <f55>   DW_AT_data_member_location: 8
 <2><f56>: Abbrev Number: 22 (DW_TAG_member)
    <f57>   DW_AT_name        : (indirect string, offset: 0x107927): PUPDR
    <f5b>   DW_AT_decl_file   : 12
    <f5c>   DW_AT_decl_line   : 605
    <f5e>   DW_AT_decl_column : 17
    <f5f>   DW_AT_type        : <0x66c>
    <f63>   DW_AT_data_member_location: 12
 <2><f64>: Abbrev Number: 23 (DW_TAG_member)
    <f65>   DW_AT_name        : IDR
    <f69>   DW_AT_decl_file   : 12
    <f6a>   DW_AT_decl_line   : 606
    <f6c>   DW_AT_decl_column : 17
    <f6d>   DW_AT_type        : <0x66c>
    <f71>   DW_AT_data_member_location: 16
 <2><f72>: Abbrev Number: 23 (DW_TAG_member)
    <f73>   DW_AT_name        : ODR
    <f77>   DW_AT_decl_file   : 12
    <f78>   DW_AT_decl_line   : 607
    <f7a>   DW_AT_decl_column : 17
    <f7b>   DW_AT_type        : <0x66c>
    <f7f>   DW_AT_data_member_location: 20
 <2><f80>: Abbrev Number: 22 (DW_TAG_member)
    <f81>   DW_AT_name        : (indirect string, offset: 0x106c9f): BSRR
    <f85>   DW_AT_decl_file   : 12
    <f86>   DW_AT_decl_line   : 608
    <f88>   DW_AT_decl_column : 17
    <f89>   DW_AT_type        : <0x66c>
    <f8d>   DW_AT_data_member_location: 24
 <2><f8e>: Abbrev Number: 22 (DW_TAG_member)
    <f8f>   DW_AT_name        : (indirect string, offset: 0x109666): LCKR
    <f93>   DW_AT_decl_file   : 12
    <f94>   DW_AT_decl_line   : 609
    <f96>   DW_AT_decl_column : 17
    <f97>   DW_AT_type        : <0x66c>
    <f9b>   DW_AT_data_member_location: 28
 <2><f9c>: Abbrev Number: 23 (DW_TAG_member)
    <f9d>   DW_AT_name        : AFR
    <fa1>   DW_AT_decl_file   : 12
    <fa2>   DW_AT_decl_line   : 610
    <fa4>   DW_AT_decl_column : 17
    <fa5>   DW_AT_type        : <0xfc9>
    <fa9>   DW_AT_data_member_location: 32
 <2><faa>: Abbrev Number: 23 (DW_TAG_member)
    <fab>   DW_AT_name        : BRR
    <faf>   DW_AT_decl_file   : 12
    <fb0>   DW_AT_decl_line   : 611
    <fb2>   DW_AT_decl_column : 17
    <fb3>   DW_AT_type        : <0x66c>
    <fb7>   DW_AT_data_member_location: 40
 <2><fb8>: Abbrev Number: 0
 <1><fb9>: Abbrev Number: 14 (DW_TAG_array_type)
    <fba>   DW_AT_type        : <0x66c>
    <fbe>   DW_AT_sibling     : <0xfc9>
 <2><fc2>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <fc3>   DW_AT_type        : <0x5d4>
    <fc7>   DW_AT_upper_bound : 1
 <2><fc8>: Abbrev Number: 0
 <1><fc9>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <fca>   DW_AT_type        : <0xfb9>
 <1><fce>: Abbrev Number: 11 (DW_TAG_typedef)
    <fcf>   DW_AT_name        : (indirect string, offset: 0x10af5a): GPIO_TypeDef
    <fd3>   DW_AT_decl_file   : 12
    <fd4>   DW_AT_decl_line   : 613
    <fd6>   DW_AT_decl_column : 3
    <fd7>   DW_AT_type        : <0xf22>
 <1><fdb>: Abbrev Number: 4 (DW_TAG_typedef)
    <fdc>   DW_AT_name        : (indirect string, offset: 0x1034a6): QueueHandle_t
    <fe0>   DW_AT_decl_file   : 13
    <fe1>   DW_AT_decl_line   : 48
    <fe2>   DW_AT_decl_column : 34
    <fe3>   DW_AT_type        : <0xfe7>
 <1><fe7>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <fe8>   DW_AT_byte_size   : 4
    <fe9>   DW_AT_type        : <0xfed>
 <1><fed>: Abbrev Number: 18 (DW_TAG_structure_type)
    <fee>   DW_AT_name        : (indirect string, offset: 0x106ee1): QueueDefinition
    <ff2>   DW_AT_declaration : 1
 <1><ff2>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff3>   DW_AT_name        : (indirect string, offset: 0x1036ad): SemaphoreHandle_t
    <ff7>   DW_AT_decl_file   : 14
    <ff8>   DW_AT_decl_line   : 37
    <ff9>   DW_AT_decl_column : 23
    <ffa>   DW_AT_type        : <0xfdb>
 <1><ffe>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <fff>   DW_AT_encoding    : 5	(signed)
    <1000>   DW_AT_byte_size   : 2
    <1001>   DW_AT_type        : <0x603>
    <1005>   DW_AT_decl_file   : 15
    <1006>   DW_AT_decl_line   : 172
    <1007>   DW_AT_decl_column : 15
    <1008>   DW_AT_sibling     : <0x103d>
 <2><100c>: Abbrev Number: 27 (DW_TAG_enumerator)
    <100d>   DW_AT_name        : (indirect string, offset: 0x109854): osPriorityIdle
    <1011>   DW_AT_const_value : -3
 <2><1012>: Abbrev Number: 27 (DW_TAG_enumerator)
    <1013>   DW_AT_name        : (indirect string, offset: 0x10a3dd): osPriorityLow
    <1017>   DW_AT_const_value : -2
 <2><1018>: Abbrev Number: 27 (DW_TAG_enumerator)
    <1019>   DW_AT_name        : (indirect string, offset: 0x10ada0): osPriorityBelowNormal
    <101d>   DW_AT_const_value : -1
 <2><101e>: Abbrev Number: 28 (DW_TAG_enumerator)
    <101f>   DW_AT_name        : (indirect string, offset: 0x108dcf): osPriorityNormal
    <1023>   DW_AT_const_value : 0
 <2><1024>: Abbrev Number: 28 (DW_TAG_enumerator)
    <1025>   DW_AT_name        : (indirect string, offset: 0x106b44): osPriorityAboveNormal
    <1029>   DW_AT_const_value : 1
 <2><102a>: Abbrev Number: 28 (DW_TAG_enumerator)
    <102b>   DW_AT_name        : (indirect string, offset: 0x103443): osPriorityHigh
    <102f>   DW_AT_const_value : 2
 <2><1030>: Abbrev Number: 28 (DW_TAG_enumerator)
    <1031>   DW_AT_name        : (indirect string, offset: 0x109fcc): osPriorityRealtime
    <1035>   DW_AT_const_value : 3
 <2><1036>: Abbrev Number: 28 (DW_TAG_enumerator)
    <1037>   DW_AT_name        : (indirect string, offset: 0x109b84): osPriorityError
    <103b>   DW_AT_const_value : 132
 <2><103c>: Abbrev Number: 0
 <1><103d>: Abbrev Number: 4 (DW_TAG_typedef)
    <103e>   DW_AT_name        : (indirect string, offset: 0x114aca): osPriority
    <1042>   DW_AT_decl_file   : 15
    <1043>   DW_AT_decl_line   : 181
    <1044>   DW_AT_decl_column : 3
    <1045>   DW_AT_type        : <0xffe>
 <1><1049>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <104a>   DW_AT_encoding    : 7	(unsigned)
    <104b>   DW_AT_byte_size   : 4
    <104c>   DW_AT_type        : <0x5d4>
    <1050>   DW_AT_decl_file   : 15
    <1051>   DW_AT_decl_line   : 189
    <1052>   DW_AT_decl_column : 15
    <1053>   DW_AT_sibling     : <0x10b5>
 <2><1057>: Abbrev Number: 28 (DW_TAG_enumerator)
    <1058>   DW_AT_name        : (indirect string, offset: 0x10838d): osOK
    <105c>   DW_AT_const_value : 0
 <2><105d>: Abbrev Number: 28 (DW_TAG_enumerator)
    <105e>   DW_AT_name        : (indirect string, offset: 0x107c16): osEventSignal
    <1062>   DW_AT_const_value : 8
 <2><1063>: Abbrev Number: 28 (DW_TAG_enumerator)
    <1064>   DW_AT_name        : (indirect string, offset: 0xfed19): osEventMessage
    <1068>   DW_AT_const_value : 16
 <2><1069>: Abbrev Number: 28 (DW_TAG_enumerator)
    <106a>   DW_AT_name        : (indirect string, offset: 0x106b23): osEventMail
    <106e>   DW_AT_const_value : 32
 <2><106f>: Abbrev Number: 28 (DW_TAG_enumerator)
    <1070>   DW_AT_name        : (indirect string, offset: 0x100d6b): osEventTimeout
    <1074>   DW_AT_const_value : 64
 <2><1075>: Abbrev Number: 28 (DW_TAG_enumerator)
    <1076>   DW_AT_name        : (indirect string, offset: 0x101dd5): osErrorParameter
    <107a>   DW_AT_const_value : 128
 <2><107b>: Abbrev Number: 28 (DW_TAG_enumerator)
    <107c>   DW_AT_name        : (indirect string, offset: 0x106d94): osErrorResource
    <1080>   DW_AT_const_value : 129
 <2><1081>: Abbrev Number: 28 (DW_TAG_enumerator)
    <1082>   DW_AT_name        : (indirect string, offset: 0x10736e): osErrorTimeoutResource
    <1086>   DW_AT_const_value : 193
 <2><1087>: Abbrev Number: 28 (DW_TAG_enumerator)
    <1088>   DW_AT_name        : (indirect string, offset: 0x101fc3): osErrorISR
    <108c>   DW_AT_const_value : 130
 <2><108d>: Abbrev Number: 28 (DW_TAG_enumerator)
    <108e>   DW_AT_name        : (indirect string, offset: 0x100521): osErrorISRRecursive
    <1092>   DW_AT_const_value : 131
 <2><1093>: Abbrev Number: 28 (DW_TAG_enumerator)
    <1094>   DW_AT_name        : (indirect string, offset: 0xff660): osErrorPriority
    <1098>   DW_AT_const_value : 132
 <2><1099>: Abbrev Number: 28 (DW_TAG_enumerator)
    <109a>   DW_AT_name        : (indirect string, offset: 0x100e19): osErrorNoMemory
    <109e>   DW_AT_const_value : 133
 <2><109f>: Abbrev Number: 28 (DW_TAG_enumerator)
    <10a0>   DW_AT_name        : (indirect string, offset: 0x10750c): osErrorValue
    <10a4>   DW_AT_const_value : 134
 <2><10a5>: Abbrev Number: 28 (DW_TAG_enumerator)
    <10a6>   DW_AT_name        : (indirect string, offset: 0x1055c8): osErrorOS
    <10aa>   DW_AT_const_value : 255
 <2><10ab>: Abbrev Number: 29 (DW_TAG_enumerator)
    <10ac>   DW_AT_name        : (indirect string, offset: 0x102add): os_status_reserved
    <10b0>   DW_AT_const_value : 0x7fffffff
 <2><10b4>: Abbrev Number: 0
 <1><10b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <10b6>   DW_AT_name        : (indirect string, offset: 0x100b2c): osStatus
    <10ba>   DW_AT_decl_file   : 15
    <10bb>   DW_AT_decl_line   : 205
    <10bc>   DW_AT_decl_column : 3
    <10bd>   DW_AT_type        : <0x1049>
 <1><10c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <10c2>   DW_AT_name        : (indirect string, offset: 0x104ee6): os_pthread
    <10c6>   DW_AT_decl_file   : 15
    <10c7>   DW_AT_decl_line   : 228
    <10c8>   DW_AT_decl_column : 16
    <10c9>   DW_AT_type        : <0x10cd>
 <1><10cd>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <10ce>   DW_AT_byte_size   : 4
    <10cf>   DW_AT_type        : <0x10d3>
 <1><10d3>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <10d4>   DW_AT_prototyped  : 1
    <10d4>   DW_AT_sibling     : <0x10de>
 <2><10d8>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <10d9>   DW_AT_type        : <0x10de>
 <2><10dd>: Abbrev Number: 0
 <1><10de>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <10df>   DW_AT_byte_size   : 4
    <10e0>   DW_AT_type        : <0x10e4>
 <1><10e4>: Abbrev Number: 30 (DW_TAG_const_type)
 <1><10e5>: Abbrev Number: 4 (DW_TAG_typedef)
    <10e6>   DW_AT_name        : (indirect string, offset: 0x106acb): osThreadId
    <10ea>   DW_AT_decl_file   : 15
    <10eb>   DW_AT_decl_line   : 238
    <10ec>   DW_AT_decl_column : 22
    <10ed>   DW_AT_type        : <0xf05>
 <1><10f1>: Abbrev Number: 4 (DW_TAG_typedef)
    <10f2>   DW_AT_name        : (indirect string, offset: 0x1079b1): osSemaphoreId
    <10f6>   DW_AT_decl_file   : 15
    <10f7>   DW_AT_decl_line   : 250
    <10f8>   DW_AT_decl_column : 27
    <10f9>   DW_AT_type        : <0xff2>
 <1><10fd>: Abbrev Number: 11 (DW_TAG_typedef)
    <10fe>   DW_AT_name        : (indirect string, offset: 0x10680d): osStaticThreadDef_t
    <1102>   DW_AT_decl_file   : 15
    <1103>   DW_AT_decl_line   : 267
    <1105>   DW_AT_decl_column : 36
    <1106>   DW_AT_type        : <0xef8>
 <1><110a>: Abbrev Number: 21 (DW_TAG_structure_type)
    <110b>   DW_AT_name        : (indirect string, offset: 0x101336): os_thread_def
    <110f>   DW_AT_byte_size   : 28
    <1110>   DW_AT_decl_file   : 15
    <1111>   DW_AT_decl_line   : 280
    <1113>   DW_AT_decl_column : 16
    <1114>   DW_AT_sibling     : <0x117b>
 <2><1118>: Abbrev Number: 22 (DW_TAG_member)
    <1119>   DW_AT_name        : (indirect string, offset: 0x109dbc): name
    <111d>   DW_AT_decl_file   : 15
    <111e>   DW_AT_decl_line   : 281
    <1120>   DW_AT_decl_column : 27
    <1121>   DW_AT_type        : <0x678>
    <1125>   DW_AT_data_member_location: 0
 <2><1126>: Abbrev Number: 22 (DW_TAG_member)
    <1127>   DW_AT_name        : (indirect string, offset: 0x104ee9): pthread
    <112b>   DW_AT_decl_file   : 15
    <112c>   DW_AT_decl_line   : 282
    <112e>   DW_AT_decl_column : 26
    <112f>   DW_AT_type        : <0x10c1>
    <1133>   DW_AT_data_member_location: 4
 <2><1134>: Abbrev Number: 22 (DW_TAG_member)
    <1135>   DW_AT_name        : (indirect string, offset: 0x1082ea): tpriority
    <1139>   DW_AT_decl_file   : 15
    <113a>   DW_AT_decl_line   : 283
    <113c>   DW_AT_decl_column : 26
    <113d>   DW_AT_type        : <0x103d>
    <1141>   DW_AT_data_member_location: 8
 <2><1142>: Abbrev Number: 22 (DW_TAG_member)
    <1143>   DW_AT_name        : (indirect string, offset: 0x10b067): instances
    <1147>   DW_AT_decl_file   : 15
    <1148>   DW_AT_decl_line   : 284
    <114a>   DW_AT_decl_column : 26
    <114b>   DW_AT_type        : <0x660>
    <114f>   DW_AT_data_member_location: 12
 <2><1150>: Abbrev Number: 22 (DW_TAG_member)
    <1151>   DW_AT_name        : (indirect string, offset: 0xffb89): stacksize
    <1155>   DW_AT_decl_file   : 15
    <1156>   DW_AT_decl_line   : 285
    <1158>   DW_AT_decl_column : 26
    <1159>   DW_AT_type        : <0x660>
    <115d>   DW_AT_data_member_location: 16
 <2><115e>: Abbrev Number: 22 (DW_TAG_member)
    <115f>   DW_AT_name        : (indirect string, offset: 0x1009ec): buffer
    <1163>   DW_AT_decl_file   : 15
    <1164>   DW_AT_decl_line   : 287
    <1166>   DW_AT_decl_column : 27
    <1167>   DW_AT_type        : <0x117b>
    <116b>   DW_AT_data_member_location: 20
 <2><116c>: Abbrev Number: 22 (DW_TAG_member)
    <116d>   DW_AT_name        : (indirect string, offset: 0x10487a): controlblock
    <1171>   DW_AT_decl_file   : 15
    <1172>   DW_AT_decl_line   : 288
    <1174>   DW_AT_decl_column : 27
    <1175>   DW_AT_type        : <0x1181>
    <1179>   DW_AT_data_member_location: 24
 <2><117a>: Abbrev Number: 0
 <1><117b>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <117c>   DW_AT_byte_size   : 4
    <117d>   DW_AT_type        : <0x660>
 <1><1181>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <1182>   DW_AT_byte_size   : 4
    <1183>   DW_AT_type        : <0x10fd>
 <1><1187>: Abbrev Number: 11 (DW_TAG_typedef)
    <1188>   DW_AT_name        : (indirect string, offset: 0xffb38): osThreadDef_t
    <118c>   DW_AT_decl_file   : 15
    <118d>   DW_AT_decl_line   : 290
    <118f>   DW_AT_decl_column : 3
    <1190>   DW_AT_type        : <0x110a>
 <1><1194>: Abbrev Number: 6 (DW_TAG_const_type)
    <1195>   DW_AT_type        : <0x1187>
 <1><1199>: Abbrev Number: 4 (DW_TAG_typedef)
    <119a>   DW_AT_name        : (indirect string, offset: 0x106fc9): UINT
    <119e>   DW_AT_decl_file   : 16
    <119f>   DW_AT_decl_line   : 19
    <11a0>   DW_AT_decl_column : 22
    <11a1>   DW_AT_type        : <0x5d4>
 <1><11a5>: Abbrev Number: 4 (DW_TAG_typedef)
    <11a6>   DW_AT_name        : (indirect string, offset: 0xbc7da): BYTE
    <11aa>   DW_AT_decl_file   : 16
    <11ab>   DW_AT_decl_line   : 22
    <11ac>   DW_AT_decl_column : 23
    <11ad>   DW_AT_type        : <0x5fc>
 <1><11b1>: Abbrev Number: 4 (DW_TAG_typedef)
    <11b2>   DW_AT_name        : (indirect string, offset: 0x100498): WORD
    <11b6>   DW_AT_decl_file   : 16
    <11b7>   DW_AT_decl_line   : 26
    <11b8>   DW_AT_decl_column : 24
    <11b9>   DW_AT_type        : <0x616>
 <1><11bd>: Abbrev Number: 4 (DW_TAG_typedef)
    <11be>   DW_AT_name        : (indirect string, offset: 0x100497): DWORD
    <11c2>   DW_AT_decl_file   : 16
    <11c3>   DW_AT_decl_line   : 31
    <11c4>   DW_AT_decl_column : 23
    <11c5>   DW_AT_type        : <0x630>
 <1><11c9>: Abbrev Number: 4 (DW_TAG_typedef)
    <11ca>   DW_AT_name        : (indirect string, offset: 0x1061b0): TCHAR
    <11ce>   DW_AT_decl_file   : 17
    <11cf>   DW_AT_decl_line   : 62
    <11d0>   DW_AT_decl_column : 14
    <11d1>   DW_AT_type        : <0x67e>
 <1><11d5>: Abbrev Number: 6 (DW_TAG_const_type)
    <11d6>   DW_AT_type        : <0x11c9>
 <1><11da>: Abbrev Number: 4 (DW_TAG_typedef)
    <11db>   DW_AT_name        : (indirect string, offset: 0x108ca7): FSIZE_t
    <11df>   DW_AT_decl_file   : 17
    <11e0>   DW_AT_decl_line   : 78
    <11e1>   DW_AT_decl_column : 15
    <11e2>   DW_AT_type        : <0x11bd>
 <1><11e6>: Abbrev Number: 31 (DW_TAG_structure_type)
    <11e7>   DW_AT_byte_size   : 564
    <11e9>   DW_AT_decl_file   : 17
    <11ea>   DW_AT_decl_line   : 85
    <11eb>   DW_AT_decl_column : 9
    <11ec>   DW_AT_sibling     : <0x12e7>
 <2><11f0>: Abbrev Number: 17 (DW_TAG_member)
    <11f1>   DW_AT_name        : (indirect string, offset: 0x101510): fs_type
    <11f5>   DW_AT_decl_file   : 17
    <11f6>   DW_AT_decl_line   : 86
    <11f7>   DW_AT_decl_column : 7
    <11f8>   DW_AT_type        : <0x11a5>
    <11fc>   DW_AT_data_member_location: 0
 <2><11fd>: Abbrev Number: 20 (DW_TAG_member)
    <11fe>   DW_AT_name        : drv
    <1202>   DW_AT_decl_file   : 17
    <1203>   DW_AT_decl_line   : 87
    <1204>   DW_AT_decl_column : 7
    <1205>   DW_AT_type        : <0x11a5>
    <1209>   DW_AT_data_member_location: 1
 <2><120a>: Abbrev Number: 17 (DW_TAG_member)
    <120b>   DW_AT_name        : (indirect string, offset: 0x1080d8): n_fats
    <120f>   DW_AT_decl_file   : 17
    <1210>   DW_AT_decl_line   : 88
    <1211>   DW_AT_decl_column : 7
    <1212>   DW_AT_type        : <0x11a5>
    <1216>   DW_AT_data_member_location: 2
 <2><1217>: Abbrev Number: 17 (DW_TAG_member)
    <1218>   DW_AT_name        : (indirect string, offset: 0x106136): wflag
    <121c>   DW_AT_decl_file   : 17
    <121d>   DW_AT_decl_line   : 89
    <121e>   DW_AT_decl_column : 7
    <121f>   DW_AT_type        : <0x11a5>
    <1223>   DW_AT_data_member_location: 3
 <2><1224>: Abbrev Number: 17 (DW_TAG_member)
    <1225>   DW_AT_name        : (indirect string, offset: 0xff024): fsi_flag
    <1229>   DW_AT_decl_file   : 17
    <122a>   DW_AT_decl_line   : 90
    <122b>   DW_AT_decl_column : 7
    <122c>   DW_AT_type        : <0x11a5>
    <1230>   DW_AT_data_member_location: 4
 <2><1231>: Abbrev Number: 20 (DW_TAG_member)
    <1232>   DW_AT_name        : id
    <1235>   DW_AT_decl_file   : 17
    <1236>   DW_AT_decl_line   : 91
    <1237>   DW_AT_decl_column : 7
    <1238>   DW_AT_type        : <0x11b1>
    <123c>   DW_AT_data_member_location: 6
 <2><123d>: Abbrev Number: 17 (DW_TAG_member)
    <123e>   DW_AT_name        : (indirect string, offset: 0x106f9b): n_rootdir
    <1242>   DW_AT_decl_file   : 17
    <1243>   DW_AT_decl_line   : 92
    <1244>   DW_AT_decl_column : 7
    <1245>   DW_AT_type        : <0x11b1>
    <1249>   DW_AT_data_member_location: 8
 <2><124a>: Abbrev Number: 17 (DW_TAG_member)
    <124b>   DW_AT_name        : (indirect string, offset: 0x1010d8): csize
    <124f>   DW_AT_decl_file   : 17
    <1250>   DW_AT_decl_line   : 93
    <1251>   DW_AT_decl_column : 7
    <1252>   DW_AT_type        : <0x11b1>
    <1256>   DW_AT_data_member_location: 10
 <2><1257>: Abbrev Number: 17 (DW_TAG_member)
    <1258>   DW_AT_name        : (indirect string, offset: 0xff74a): sobj
    <125c>   DW_AT_decl_file   : 17
    <125d>   DW_AT_decl_line   : 104
    <125e>   DW_AT_decl_column : 10
    <125f>   DW_AT_type        : <0x10f1>
    <1263>   DW_AT_data_member_location: 12
 <2><1264>: Abbrev Number: 17 (DW_TAG_member)
    <1265>   DW_AT_name        : (indirect string, offset: 0x105a8b): last_clst
    <1269>   DW_AT_decl_file   : 17
    <126a>   DW_AT_decl_line   : 107
    <126b>   DW_AT_decl_column : 8
    <126c>   DW_AT_type        : <0x11bd>
    <1270>   DW_AT_data_member_location: 16
 <2><1271>: Abbrev Number: 17 (DW_TAG_member)
    <1272>   DW_AT_name        : (indirect string, offset: 0x100f3c): free_clst
    <1276>   DW_AT_decl_file   : 17
    <1277>   DW_AT_decl_line   : 108
    <1278>   DW_AT_decl_column : 8
    <1279>   DW_AT_type        : <0x11bd>
    <127d>   DW_AT_data_member_location: 20
 <2><127e>: Abbrev Number: 17 (DW_TAG_member)
    <127f>   DW_AT_name        : (indirect string, offset: 0x104e6d): n_fatent
    <1283>   DW_AT_decl_file   : 17
    <1284>   DW_AT_decl_line   : 118
    <1285>   DW_AT_decl_column : 8
    <1286>   DW_AT_type        : <0x11bd>
    <128a>   DW_AT_data_member_location: 24
 <2><128b>: Abbrev Number: 17 (DW_TAG_member)
    <128c>   DW_AT_name        : (indirect string, offset: 0x104943): fsize
    <1290>   DW_AT_decl_file   : 17
    <1291>   DW_AT_decl_line   : 119
    <1292>   DW_AT_decl_column : 8
    <1293>   DW_AT_type        : <0x11bd>
    <1297>   DW_AT_data_member_location: 28
 <2><1298>: Abbrev Number: 17 (DW_TAG_member)
    <1299>   DW_AT_name        : (indirect string, offset: 0x1073b2): volbase
    <129d>   DW_AT_decl_file   : 17
    <129e>   DW_AT_decl_line   : 120
    <129f>   DW_AT_decl_column : 8
    <12a0>   DW_AT_type        : <0x11bd>
    <12a4>   DW_AT_data_member_location: 32
 <2><12a5>: Abbrev Number: 17 (DW_TAG_member)
    <12a6>   DW_AT_name        : (indirect string, offset: 0x10224c): fatbase
    <12aa>   DW_AT_decl_file   : 17
    <12ab>   DW_AT_decl_line   : 121
    <12ac>   DW_AT_decl_column : 8
    <12ad>   DW_AT_type        : <0x11bd>
    <12b1>   DW_AT_data_member_location: 36
 <2><12b2>: Abbrev Number: 17 (DW_TAG_member)
    <12b3>   DW_AT_name        : (indirect string, offset: 0x104957): dirbase
    <12b7>   DW_AT_decl_file   : 17
    <12b8>   DW_AT_decl_line   : 122
    <12b9>   DW_AT_decl_column : 8
    <12ba>   DW_AT_type        : <0x11bd>
    <12be>   DW_AT_data_member_location: 40
 <2><12bf>: Abbrev Number: 17 (DW_TAG_member)
    <12c0>   DW_AT_name        : (indirect string, offset: 0x10253c): database
    <12c4>   DW_AT_decl_file   : 17
    <12c5>   DW_AT_decl_line   : 123
    <12c6>   DW_AT_decl_column : 8
    <12c7>   DW_AT_type        : <0x11bd>
    <12cb>   DW_AT_data_member_location: 44
 <2><12cc>: Abbrev Number: 17 (DW_TAG_member)
    <12cd>   DW_AT_name        : (indirect string, offset: 0x108346): winsect
    <12d1>   DW_AT_decl_file   : 17
    <12d2>   DW_AT_decl_line   : 124
    <12d3>   DW_AT_decl_column : 8
    <12d4>   DW_AT_type        : <0x11bd>
    <12d8>   DW_AT_data_member_location: 48
 <2><12d9>: Abbrev Number: 20 (DW_TAG_member)
    <12da>   DW_AT_name        : win
    <12de>   DW_AT_decl_file   : 17
    <12df>   DW_AT_decl_line   : 125
    <12e0>   DW_AT_decl_column : 7
    <12e1>   DW_AT_type        : <0x12e7>
    <12e5>   DW_AT_data_member_location: 52
 <2><12e6>: Abbrev Number: 0
 <1><12e7>: Abbrev Number: 14 (DW_TAG_array_type)
    <12e8>   DW_AT_type        : <0x11a5>
    <12ec>   DW_AT_sibling     : <0x12f8>
 <2><12f0>: Abbrev Number: 32 (DW_TAG_subrange_type)
    <12f1>   DW_AT_type        : <0x5d4>
    <12f5>   DW_AT_upper_bound : 511
 <2><12f7>: Abbrev Number: 0
 <1><12f8>: Abbrev Number: 4 (DW_TAG_typedef)
    <12f9>   DW_AT_name        : (indirect string, offset: 0x103b7b): FATFS
    <12fd>   DW_AT_decl_file   : 17
    <12fe>   DW_AT_decl_line   : 126
    <12ff>   DW_AT_decl_column : 3
    <1300>   DW_AT_type        : <0x11e6>
 <1><1304>: Abbrev Number: 16 (DW_TAG_structure_type)
    <1305>   DW_AT_byte_size   : 20
    <1306>   DW_AT_decl_file   : 17
    <1307>   DW_AT_decl_line   : 132
    <1308>   DW_AT_decl_column : 9
    <1309>   DW_AT_sibling     : <0x1367>
 <2><130d>: Abbrev Number: 20 (DW_TAG_member)
    <130e>   DW_AT_name        : fs
